{
    "count": 237,
    "next": null,
    "previous": null,
    "results": [
        {
            "uuid": "4c8e29c0-b931-4af5-be6b-357b821e6b10",
            "title": "The Shawshank Redemption",
            "pub_date": 1994,
            "duration": 142,
            "rating": 9.3,
            "description": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.                Written by\nJ-S-Golden",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1_SY500_CR0,0,336,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "2ac8c5d2-a9d4-4403-bc9e-2b40e4f399ac",
            "title": "The Godfather",
            "pub_date": 1972,
            "duration": 175,
            "rating": 9.2,
            "description": "When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen.                Written by\nJ. S. Golden",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZTRmNjQ1ZDYtNDgzMy00OGE0LWE4N2YtNTkzNWQ5ZDhlNGJmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,352,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "ac79397f-801e-4d6b-a267-32ac19b20642",
            "title": "The Godfather: Part II",
            "pub_date": 1974,
            "duration": 202,
            "rating": 9.0,
            "description": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.                Written by\nKeith Loh <loh@sfu.ca>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjZiNzIxNTQtNDc5Zi00YWY1LThkMTctMDgzYjY4YjI1YmQyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,351,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "603e16e2-979b-4c23-ae5f-300c1d595468",
            "title": "The Dark Knight",
            "pub_date": 2008,
            "duration": 152,
            "rating": 9.0,
            "description": "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes.                Written by\nLeon Lombardi",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Action",
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "8fe1386c-5193-4b42-9373-9f56490d1813",
            "title": "12 Angry Men",
            "pub_date": 1957,
            "duration": 96,
            "rating": 8.9,
            "description": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other. Based on the play, all of the action takes place on the stage of the jury room.                Written by\npjk <PETESID@VNET.IBM.COM>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODQwOTc5MDM2N15BMl5BanBnXkFtZTcwODQxNTEzNA@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "9e91c161-af0a-453c-a09b-77cada947751",
            "title": "Schindler's List",
            "pub_date": 1993,
            "duration": 195,
            "rating": 8.9,
            "description": "Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.                Written by\nHarald Mayr <marvin@bike.augusta.de>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4OTMxMTctNmRhYy00NWE2LTg3YzItYTk3M2UwOTU5Njg4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "572cc7ec-b14a-467f-90cb-64fc45b50e68",
            "title": "Pulp Fiction",
            "pub_date": 1994,
            "duration": 154,
            "rating": 8.9,
            "description": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his weight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.                Written by\nSoumitra",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTA5OTAzMl5BMl5BanBnXkFtZTgwNjA5MDc3NjE@._V1_SY500_CR0,0,336,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "41cd4803-c02f-48cc-bd33-6f5e6a70decc",
            "title": "The Lord of the Rings: The Return of the King",
            "pub_date": 2003,
            "duration": 201,
            "rating": 8.9,
            "description": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the \"one ring\", while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYWY1ZWQ5YjMtMDE0MS00NWIzLWE1M2YtODYzYTk2OTNlYWZmXkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SY500_SX334_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Fantasy"
            ]
        },
        {
            "uuid": "5eafc7c8-3cee-48b3-b2c7-7545ff314d1a",
            "title": "Il buono, il brutto, il cattivo",
            "pub_date": 1966,
            "duration": 161,
            "rating": 8.9,
            "description": "Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to ...                Written by\nJeremy Thomson",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5NDI3MTI4MF5BMl5BanBnXkFtZTgwNDQ4ODE5MDE@._V1_SY500_CR0,0,328,500_AL_.jpg",
            "categories": [
                "Western"
            ]
        },
        {
            "uuid": "e1cb267a-1210-4703-a2fe-0c921de20c50",
            "title": "Fight Club",
            "pub_date": 1999,
            "duration": 139,
            "rating": 8.8,
            "description": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. When the narrator is exposed to the hidden agenda of Tyler's fight club, he must accept the awful truth that Tyler may not be who he says he is.                Written by\nRhiannon",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZGY5Y2RjMmItNDg5Yy00NjUwLThjMTEtNDc2OGUzNTBiYmM1XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX290_CR0,0,290,429_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "0461c138-a2a3-4273-9aee-74f3c6804de6",
            "title": "Admin movie",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "e8e3f857-31c4-4fc6-8e8e-af8daa0db683",
            "title": "test 3",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Biography"
            ]
        },
        {
            "uuid": "950a0808-56d9-4797-b652-38962483c4ec",
            "title": "test",
            "pub_date": 1974,
            "duration": 200,
            "rating": 4.0,
            "description": "something for description",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "26d68694-2b5d-4d31-9423-971714c8442d",
            "title": "Check this",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "3a823abe-313b-4972-a160-416cf48f1fb8",
            "title": "The Lord of the Rings: The Fellowship of the Ring",
            "pub_date": 2001,
            "duration": 178,
            "rating": 8.8,
            "description": "An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!                Written by\nPaul Twomey <toomsp@hotmail.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNmFmZDdkODMtNzUyMy00NzhhLWFjZmEtMGMzYjNhMDA1NTBkXkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SY500_SX342_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Fantasy"
            ]
        },
        {
            "uuid": "a42f7b51-e80b-4fe8-8b78-e821eb516eb1",
            "title": "Star Wars: Episode V - The Empire Strikes Back",
            "pub_date": 1980,
            "duration": 124,
            "rating": 8.8,
            "description": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYmViY2M2MTYtY2MzOS00YjQ1LWIzYmEtOTBiNjhlMGM0NjZjXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,322,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "62197fbd-ca30-4747-ada4-3688620089f1",
            "title": "Forrest Gump",
            "pub_date": 1994,
            "duration": 142,
            "rating": 8.8,
            "description": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone.                Written by\naliw135",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYThjM2MwZGMtMzg3Ny00NGRkLWE4M2EtYTBiNWMzOTY0YTI4XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,378,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Romance"
            ]
        },
        {
            "uuid": "88720ab1-f9cc-40e0-bc9f-0a31748debf4",
            "title": "Inception",
            "pub_date": 2010,
            "duration": 148,
            "rating": 8.8,
            "description": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible - inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.                Written by\nWarner Bros. Pictures",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "a3ab312d-c2ce-41e4-88f7-78444396cf8c",
            "title": "The Lord of the Rings: The Two Towers",
            "pub_date": 2002,
            "duration": 179,
            "rating": 8.7,
            "description": "While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNDU0NjY4NTheQTJeQWpwZ15BbWU2MDk4MTY2Nw@@._V1_SY256_SX175_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Fantasy"
            ]
        },
        {
            "uuid": "113191e1-5bf5-4c73-b11f-6a15a0cad735",
            "title": "One Flew Over the Cuckoo's Nest",
            "pub_date": 1975,
            "duration": 133,
            "rating": 8.7,
            "description": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.                Written by\nJacob Oberfrank",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjA0OWVhOTAtYWQxNi00YzNhLWI4ZjYtNjFjZTEyYjJlNDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,336,500_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "ec371c3c-8295-46f0-9e23-e40eb0958f83",
            "title": "Goodfellas",
            "pub_date": 1990,
            "duration": 146,
            "rating": 8.7,
            "description": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?                Written by\nColin Tinto <cst@imdb.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNThjMzczMjctZmIwOC00NTQ4LWJhZWItZDdhNTk5ZTdiMWFlXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,334,500_AL_.jpg",
            "categories": [
                "Biography",
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "f567121c-7ccd-4448-9f09-e346fde8bbaf",
            "title": "The Matrix",
            "pub_date": 1999,
            "duration": 136,
            "rating": 8.7,
            "description": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.                Written by\nredcommander27",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Action",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "774c8b3a-4922-4029-99ba-270a2001ef47",
            "title": "Shichinin no samurai",
            "pub_date": 1954,
            "duration": 207,
            "rating": 8.7,
            "description": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village.                Written by\nColin Tinto <cst@imdb.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDY1MjU5MF5BMl5BanBnXkFtZTgwNDM2OTE4MzE@._V1_SY500_CR0,0,356,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama"
            ]
        },
        {
            "uuid": "08c069aa-d68e-4cdd-9750-4377b9155522",
            "title": "Admin movie",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "83524ada-ab6a-4ae6-b8b1-02de8bfc0a0c",
            "title": "test 3",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Action"
            ]
        },
        {
            "uuid": "7e19fda7-a1ea-4995-8bad-e2f75b6cadf9",
            "title": "test",
            "pub_date": 1974,
            "duration": 200,
            "rating": 4.0,
            "description": "something for description",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "c621964c-91a5-438d-baf0-d78d24947da5",
            "title": "Check this",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "7df88044-97c3-4be9-a118-f22e90a69a73",
            "title": "Star Wars",
            "pub_date": 1977,
            "duration": 121,
            "rating": 8.7,
            "description": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYzQ2OTk4N2QtOGQwNy00MmI3LWEwNmEtOTk0OTY3NDk2MGJkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "079e3590-5957-44a7-99cc-421f397fc632",
            "title": "Cidade de Deus",
            "pub_date": 2002,
            "duration": 130,
            "rating": 8.7,
            "description": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God.                Written by\nJeff Mellinger <jeffmellinger@astound.net>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODQ3ODkzNV5BMl5BanBnXkFtZTYwOTc4NDI3._V1_SX200_CR0,0,200,296_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "dfda93ea-6764-4552-a544-206a77abcf31",
            "title": "Se7en",
            "pub_date": 1995,
            "duration": 127,
            "rating": 8.6,
            "description": "A film about two homicide detectives' (Morgan Freeman and (Brad Pitt desperate hunt for a serial killer who justifies his crimes as absolution for the world's ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" (Kevin Spacey) sermonizes to Detectives Somerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer's terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Somerset researches the Seven Deadly Sins in an effort to understand the killer's modus operandi while the bright but green and impulsive Detective Mills (Pitt) scoffs at his efforts to get inside the mind of a killer...                Written by\nMark Fleetwood <mfleetwo@mail.coin.missouri.edu>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTUwODM5MTctZjczMi00OTk4LTg3NWUtNmVhMTAzNTNjYjcyXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,319,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "81ebb7b9-ac43-4863-8cdf-434d97c0239c",
            "title": "The Silence of the Lambs",
            "pub_date": 1991,
            "duration": 118,
            "rating": 8.6,
            "description": "FBI trainee Clarice Starling works hard to advance her career, including trying to hide or put behind her West Virginia roots, of which if some knew would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford does ask her to question Dr. Hannibal Lecter, a psychiatrist imprisoned thus far for eight years in maximum security isolation for being a serial killer, he who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight especially around the hips, all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkzMDI4OF5BMl5BanBnXkFtZTcwMDA0NzE1NA@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "996fbd1b-f98e-458f-baa5-e0874c4aca07",
            "title": "It's a Wonderful Life",
            "pub_date": 1946,
            "duration": 130,
            "rating": 8.6,
            "description": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his ...                Written by\nalfiehitchie",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzY5NDc4M15BMl5BanBnXkFtZTcwMzc4NjIxNw@@._V1_SY500_CR0,0,334,500_AL_.jpg",
            "categories": [
                "Drama",
                "Family",
                "Fantasy"
            ]
        },
        {
            "uuid": "43bb3374-ce2c-452f-aed3-cb73359452f9",
            "title": "The Usual Suspects",
            "pub_date": 1995,
            "duration": 106,
            "rating": 8.6,
            "description": "Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?                Written by\nSoumitra",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MjI5MDQyOV5BMl5BanBnXkFtZTcwNzE4Mjg3NA@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "c162f0f9-bd3f-4d33-a8e7-5abd7a1efaad",
            "title": "La vita è bella",
            "pub_date": 1997,
            "duration": 116,
            "rating": 8.6,
            "description": "In 1930s Italy, a carefree Jewish book keeper named Guido starts a fairy tale life by courting and marrying a lovely woman from a nearby city. Guido and his wife have a son and live happily together until the occupation of Italy by German forces. In an attempt to hold his family together and help his son survive the horrors of a Jewish Concentration Camp, Guido imagines that the Holocaust is a game and that the grand prize for winning is a tank.                Written by\nAnthony Hughes <husnock31@hotmail.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYmJmM2Q4NmMtYThmNC00ZjRlLWEyZmItZTIwOTBlZDQ3NTQ1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_SX335_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "03d43eb2-8ab6-4cf4-b44a-00f9537b8a4e",
            "title": "Léon",
            "pub_date": 1994,
            "duration": 110,
            "rating": 8.6,
            "description": "After her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother.                Written by\nJ. S. Golden",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjdjMGU3MGYtN2Y5ZC00MTE4LWE4YWQtMTBhMjc3MTk0ZDUwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_SX332_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "fde0f316-8235-4986-b97f-b6547ba24ae5",
            "title": "Lawrence of Arabia",
            "pub_date": 1962,
            "duration": 216,
            "rating": 8.3,
            "description": "Due to his knowledge of the native Bedouin tribes, British Lieutenant T.E. Lawrence is sent to Arabia to find Prince Faisal and serve as a liaison between the Arabs and the British in their fight against the Turks. With the aid of native Sherif Ali, Lawrence rebels against the orders of his superior officer and strikes out on a daring camel journey across the harsh desert to attack a well-guarded Turkish port.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYWY5ZjhjNGYtZmI2Ny00ODM0LWFkNzgtZmI1YzA2N2MxMzA0XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY500_CR0,0,346,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Biography",
                "Drama"
            ]
        },
        {
            "uuid": "2c9a914d-7d03-48b0-aa59-6c2fee110574",
            "title": "Movie 11/5",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Crime"
            ]
        },
        {
            "uuid": "e3e15490-975a-4883-9cf0-671d64398517",
            "title": "Sen to Chihiro no kamikakushi",
            "pub_date": 2001,
            "duration": 125,
            "rating": 8.6,
            "description": "Chihiro and her parents are moving to a small Japanese town in the countryside, much to Chihiro's dismay. On the way to their new home, Chihiro's father makes a wrong turn and drives down a lonely one-lane road which dead-ends in front of a tunnel. Her parents decide to stop the car and explore the area. They go through the tunnel and find an abandoned amusement park on the other side, with its own little town. When her parents see a restaurant with great-smelling food but no staff, they decide to eat and pay later. However, Chihiro refuses to eat and decides to explore the theme park a bit more. She meets a boy named Haku who tells her that Chihiro and her parents are in danger, and they must leave immediately. She runs to the restaurant and finds that her parents have turned into pigs. In addition, the theme park turns out to be a town inhabited by demons, spirits, and evil gods. At the center of the town is a bathhouse where these creatures go to relax. The owner of the bathhouse ...                Written by\nZachary Harper",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNmU5OTQ0OWQtOTY0OS00Yjg4LWE1NDYtNDRhYWMxYWY4OTMwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,352,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Family"
            ]
        },
        {
            "uuid": "f2e4adb0-85dc-4baa-a461-7839acf8e1c3",
            "title": "Saving Private Ryan",
            "pub_date": 1998,
            "duration": 169,
            "rating": 8.6,
            "description": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...                Written by\nJ.Zelman",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjhkMDM4MWItZTVjOC00ZDRhLThmYTAtM2I5NzBmNmNlMzI1XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,339,500_AL_.jpg",
            "categories": [
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "cff0e771-9ddf-442f-9265-83770f4957db",
            "title": "C'era una volta il West",
            "pub_date": 1968,
            "duration": 175,
            "rating": 8.6,
            "description": "Story of a young woman, Mrs. McBain, who moves from New Orleans to frontier Utah, on the very edge of the American West. She arrives to find her new husband and family slaughtered, but by whom? The prime suspect, coffee-lover Cheyenne, befriends her and offers to go after the real killer, assassin gang leader Frank, in her honor. He is accompanied by Harmonica, a man already on a quest to get even.                Written by\nDrGoodBeat / edited by statmanjeff",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYjFiOTlmMzgtOGZlYi00NjY0LThmMzEtNmQ0OTgxNGViOTZmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY500_CR0,0,329,500_AL_.jpg",
            "categories": [
                "Western"
            ]
        },
        {
            "uuid": "21f45082-852e-4716-9c4b-e29abb23e53d",
            "title": "American History X",
            "pub_date": 1998,
            "duration": 119,
            "rating": 8.6,
            "description": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.                Written by\nNitesh D.(nmxpa7@msn.com)",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BY2E2MWU5ZDktOTQ0OS00NGIzLTg4YTgtYjFhNTRlMjA1NzFjL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY500_SX340_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "688878a2-5f1a-45fc-adbc-a8705d08b028",
            "title": "Interstellar",
            "pub_date": 2014,
            "duration": 169,
            "rating": 8.6,
            "description": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTU4MzY4MF5BMl5BanBnXkFtZTgwMzM4ODI3MjE@._V1_SY500_CR0,0,320,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "b2d17303-5019-4422-a4ef-292bd48fec9a",
            "title": "Casablanca",
            "pub_date": 1942,
            "duration": 102,
            "rating": 8.6,
            "description": "In World War II Casablanca, Rick Blaine, exiled American and former freedom fighter, runs the most popular nightspot in town. The cynical lone wolf Blaine comes into the possession of two valuable letters of transit. When Nazi Major Strasser arrives in Casablanca, the sycophantic police Captain Renault does what he can to please him, including detaining a Czechoslovak underground leader Victor Laszlo. Much to Rick's surprise, Lazslo arrives with Ilsa, Rick's one time love. Rick is very bitter towards Ilsa, who ran out on him in Paris, but when he learns she had good reason to, they plan to run off together again using the letters of transit. Well, that was their original plan....                Written by\nGary Jackson <garyjack5@cogeco.ca>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BY2IzZGY2YmEtYzljNS00NTM5LTgwMzUtMzM1NjQ4NGI0OTk0XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY377_SX250_AL_.jpg",
            "categories": [
                "Drama",
                "Romance",
                "War"
            ]
        },
        {
            "uuid": "cdf6f16e-4eda-45c3-aba5-ca8705333428",
            "title": "Psycho",
            "pub_date": 1960,
            "duration": 109,
            "rating": 8.5,
            "description": "Phoenix officeworker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks and they cannot get married because Sam has to give most of his money away in alimony. One Friday Marion is trusted to bank $40,000 by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into The Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother.                Written by\nCol Needham <col@imdb.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMDI3OWRmOTEtOWJhYi00N2JkLTgwNGItMjdkN2U0NjFiZTYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,331,500_AL_.jpg",
            "categories": [
                "Horror",
                "Mystery",
                "Thriller"
            ]
        },
        {
            "uuid": "54b96a95-b049-4796-9503-3e30c771e2e5",
            "title": "City Lights",
            "pub_date": 1931,
            "duration": 87,
            "rating": 8.6,
            "description": "A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.                Written by\nJohn J. Magee <magee@helix.mgh.harvard.edu>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMmI3ZjgtMGE3Mi00NjY5LTg0NWMtMmU3YzgyMjhmMjIzL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY500_CR0,0,330,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Romance"
            ]
        },
        {
            "uuid": "9b726af9-3725-4018-94b6-2fc612d44853",
            "title": "The Green Mile",
            "pub_date": 1999,
            "duration": 189,
            "rating": 8.5,
            "description": "Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift.                Written by\nGuy Johns",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMzQyNjA5MF5BMl5BanBnXkFtZTYwOTU2NTY3._V1_SY370_SX250_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Fantasy"
            ]
        },
        {
            "uuid": "362649eb-1d16-4d81-a58d-fb3aa3469741",
            "title": "Intouchables",
            "pub_date": 2011,
            "duration": 112,
            "rating": 8.6,
            "description": "In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, the rude African Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees.                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDA3MDQwNl5BMl5BanBnXkFtZTcwNTU4Mzc1Nw@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Biography",
                "Comedy",
                "Drama"
            ]
        },
        {
            "uuid": "9600e55f-3718-4f54-8e8c-6faa64c0e730",
            "title": "Modern Times",
            "pub_date": 1936,
            "duration": 87,
            "rating": 8.5,
            "description": "Chaplins last 'silent' film, filled with sound effects, was made when everyone else was making talkies. Charlie turns against modern society, the machine age, (The use of sound in films ?) and progress. Firstly we see him frantically trying to keep up with a production line, tightening bolts. He is selected for an experiment with an automatic feeding machine, but various mishaps leads his boss to believe he has gone mad, and Charlie is sent to a mental hospital... When he gets out, he is mistaken for a communist while waving a red flag, sent to jail, foils a jailbreak, and is let out again. We follow Charlie through many more escapades before the film is out.                Written by\nColin Tinto <cst@imdb.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYjJiZjMzYzktNjU0NS00OTkxLWEwYzItYzdhYWJjN2QzMTRlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY450_SX289_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Family"
            ]
        },
        {
            "uuid": "ab0a85d1-c593-42c3-a01b-69535aef65a2",
            "title": "Raiders of the Lost Ark",
            "pub_date": 1981,
            "duration": 115,
            "rating": 8.5,
            "description": "The year is 1936. An archeology professor named Indiana Jones is venturing in the jungles of South America searching for a golden statue. Unfortunately, he sets off a deadly trap but miraculously escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to humanly existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Rene Belloq and a band of Nazis in order to reach it.                Written by\nJohn Wiggins",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0ODEzMTc1Nl5BMl5BanBnXkFtZTcwODM2MjAxNA@@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure"
            ]
        },
        {
            "uuid": "7228224b-4f35-455a-a6fa-19767d52854a",
            "title": "Rear Window",
            "pub_date": 1954,
            "duration": 112,
            "rating": 8.5,
            "description": "Professional photographer L.B. \"Jeff\" Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate.                Written by\nCol Needham <col@imdb.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNGUxYWM3M2MtMGM3Mi00ZmRiLWE0NGQtZjE5ODI2OTJhNTU0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,341,500_AL_.jpg",
            "categories": [
                "Mystery",
                "Thriller"
            ]
        },
        {
            "uuid": "066db87c-fb32-4437-b9f4-e7c1145cbce1",
            "title": "The Pianist",
            "pub_date": 2002,
            "duration": 150,
            "rating": 8.5,
            "description": "In this adaptation of the autobiography \"The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,\" Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOWRiZDIxZjktMTA1NC00MDQ2LWEzMjUtMTliZmY3NjQ3ODJiXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,362,500_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "0c49f058-5d31-4f01-8736-14f601f1d046",
            "title": "The Departed",
            "pub_date": 2006,
            "duration": 151,
            "rating": 8.5,
            "description": "In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?                Written by\nAnonymous",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MTY2OTIxNV5BMl5BanBnXkFtZTYwNjQ4NjY3._V1_SX225_CR0,0,225,332_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "c44a4bc1-9fb3-4ac4-94bb-52e791f76589",
            "title": "Terminator 2: Judgment Day",
            "pub_date": 1991,
            "duration": 137,
            "rating": 8.5,
            "description": "Over 10 years have passed since the first cyborg called The Terminator tried to kill Sarah Connor and her unborn son, John Connor. John Connor, the future leader of the human resistance, is now a healthy young boy. However another Terminator is sent back through time called the T-1000, which is more advanced and more powerful than its predecessor. The Mission: to kill John Connor when he's still a child. However, Sarah and John do not have to face this threat of a Terminator alone. Another Terminator is also sent back through time. The mission: to protect John and Sarah Connor at all costs. The battle for tomorrow has begun...                Written by\nEric ggg",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZDM2YjYwYWMtMWZlNi00ZDQxLWExMDctMDAzNzQ0OTkzZjljXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Action",
                "Sci-Fi",
                "Thriller"
            ]
        },
        {
            "uuid": "bbd1be36-66c9-4a63-8e8a-0f796b2d77c1",
            "title": "Back to the Future",
            "pub_date": 1985,
            "duration": 116,
            "rating": 8.5,
            "description": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.                Written by\nRobert Lynch <docrlynch@yahoo.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZmU0M2Y1OGUtZjIxNi00ZjBkLTg1MjgtOWIyNThiZWIwYjRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,321,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Comedy",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "2cbbcc14-defb-4772-a4ff-ad9acc73f73a",
            "title": "Whiplash",
            "pub_date": 2014,
            "duration": 107,
            "rating": 8.5,
            "description": "A young and talented drummer attending a prestigious music academy finds himself under the wing of the most respected professor at the school, one who does not hold back on abuse towards his students. The two form an odd relationship as the student wants to achieve greatness, and the professor pushes him.                Written by\nandrewhodkinson",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTVhMWQ5MDktMGE3OS00MjVlLWExZWYtMzY2MTg4ZGFiZDQ5L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Drama",
                "Music"
            ]
        },
        {
            "uuid": "459807a6-8501-4275-aff8-4f0bef40e86c",
            "title": "Gladiator",
            "pub_date": 2000,
            "duration": 155,
            "rating": 8.5,
            "description": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge.                Written by\nChris \"Morphy\" Terry",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQzNTQ1Ml5BMl5BanBnXkFtZTgwMDY2NTYxMTE@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Drama"
            ]
        },
        {
            "uuid": "11dfa2eb-936a-441b-8022-e4bd146cb2af",
            "title": "Memento",
            "pub_date": 2000,
            "duration": 113,
            "rating": 8.5,
            "description": "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.                Written by\nScion013",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZTcyNjk1MjgtOWI3Mi00YzQwLWI5MTktMzY4ZmI2NDAyNzYzXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,340,500_AL_.jpg",
            "categories": [
                "Mystery",
                "Thriller"
            ]
        },
        {
            "uuid": "271955dd-314a-4609-a9f9-7048664ff228",
            "title": "Test Movie",
            "pub_date": 2023,
            "duration": 90,
            "rating": 7.0,
            "description": "TEst",
            "poster_url": null,
            "categories": [
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "d01cbf3a-7ae4-4dfc-8089-c063eeea5111",
            "title": "Apocalypse Now",
            "pub_date": 1979,
            "duration": 153,
            "rating": 8.5,
            "description": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him! Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will...                Written by\nDerek O'Cain",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODViM2VjYWYtMzU5Ny00ZjczLWEzNjMtODZmNGMwZDAxNzJkXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY370_CR0,0,242,370_AL_.jpg",
            "categories": [
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "80a98263-6cff-448d-b6db-ad1900d0a351",
            "title": "The Prestige",
            "pub_date": 2006,
            "duration": 130,
            "rating": 8.5,
            "description": "In the end of the Nineteenth Century, in London, Robert Angier, his beloved wife Julia McCullough and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDI0MTIxNF5BMl5BanBnXkFtZTYwNTM0MzY2._V1_SX225_CR0,0,225,333_AL_.jpg",
            "categories": [
                "Drama",
                "Mystery",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "8a3b3396-27aa-466c-b6da-7f5cdea7f138",
            "title": "The Lion King",
            "pub_date": 1994,
            "duration": 88,
            "rating": 8.5,
            "description": "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?                Written by\nfemaledragon1234",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYTYxNGMyZTYtMjE3MS00MzNjLWFjNmYtMDk3N2FmM2JiM2M1XkEyXkFqcGdeQXVyNjY5NDU4NzI@._V1_SY500_CR0,0,336,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Drama"
            ]
        },
        {
            "uuid": "540a3d5c-1539-4f93-b583-14ef72664023",
            "title": "Alien",
            "pub_date": 1979,
            "duration": 117,
            "rating": 8.5,
            "description": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realize that they are not alone on the spaceship when an alien stowaway is on the cargo ship.                Written by\nblazesnakes9",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDNhN2IxZWItNGEwYS00ZDNhLThiM2UtODU3NWJlZjBkYjQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,340,500_AL_.jpg",
            "categories": [
                "Horror",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "da4a8877-091d-443a-95f7-90bc5dfe2e8e",
            "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb",
            "pub_date": 1964,
            "duration": 95,
            "rating": 8.5,
            "description": "Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an all ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTkxYjUxNDYtZGY0My00NTc2LThiZmYtNmNmNmU0NGVkZWYwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SY500_CR0,0,326,500_AL_.jpg",
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "0dac1b0a-427e-4324-9822-610dfc68dcfc",
            "title": "Sunset Blvd.",
            "pub_date": 1950,
            "duration": 110,
            "rating": 8.5,
            "description": "In Hollywood of the 50's, the obscure screenplay writer Joe Gillis is not able to sell his work to the studios, is full of debts and is thinking in returning to his hometown to work in an office. While trying to escape from his creditors, he has a flat tire and parks his car in a decadent mansion in Sunset Boulevard. He meets the owner and former silent-movie star Norma Desmond, who lives alone wit her butler and driver Max von Mayerling. Norma is demented and believes she will return to the cinema industry, and is protected and isolated from the world by Max, who was his director and husband in the past and still loves her. Norma proposes Joe to move to the mansion and help her in writing a screenplay for her comeback to the cinema, and the small-time writer becomes her lover and gigolo. When Joe falls in love for the young aspirant writer Betty Schaefer, Norma becomes jealous and completely insane and her madness leads to a tragic end.                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDYzODAwNV5BMl5BanBnXkFtZTgwODg1MTczMTE@._V1_SY250_SX166_AL_.jpg",
            "categories": [
                "Drama",
                "Film-Noir"
            ]
        },
        {
            "uuid": "4f6f2df0-bebf-4c15-9de1-f665068ae830",
            "title": "The Great Dictator",
            "pub_date": 1940,
            "duration": 125,
            "rating": 8.5,
            "description": "Twenty years after the end of WWI in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state, and the decimation of the Jews. This situation is unknown to a simple Jewish-Tomainian barber who has since been hospitalized the result of a WWI battle. Upon his release, the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah, with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, who he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a want for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMmExYWJjNTktNGUyZS00ODhmLTkxYzAtNWIzOGEyMGNiMmUwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,338,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "78ce6b7a-f71e-48f5-bdff-ef811afd84b7",
            "title": "Nuovo Cinema Paradiso",
            "pub_date": 1988,
            "duration": 155,
            "rating": 8.5,
            "description": "A famous film director remembers his childhood at the Cinema Paradiso where Alfredo, the projectionist, first brought about his love of films. He returns home to his Sicilian village for the first time after almost 30 years and is reminded of his first love, Elena, who disappeared from his life before he left for Rome.                Written by\nGraeme Roy <gsr@cbmamiga.demon.co.uk>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTgzOTEwOF5BMl5BanBnXkFtZTgwNTUxNjcxMTE@._V1_SY249_CR0,0,168,249_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "4f09df4a-39f9-40c1-9719-84421bf83340",
            "title": "qweqwqweqwe",
            "pub_date": 12345,
            "duration": 0,
            "rating": 5.0,
            "description": "qwewqeqweqwe",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "8c0698ea-de2e-4cb1-9f3f-718ca0b4da31",
            "title": "New movie test",
            "pub_date": 2024,
            "duration": 50,
            "rating": 2.0,
            "description": "some desc",
            "poster_url": null,
            "categories": [
                "Biography",
                "History"
            ]
        },
        {
            "uuid": "68e5456e-e087-4cc5-9264-fa8d6cdcb0bd",
            "title": "Titanic",
            "pub_date": 1999,
            "duration": 150,
            "rating": 9.0,
            "description": "description",
            "poster_url": null,
            "categories": [
                "Action",
                "History"
            ]
        },
        {
            "uuid": "99649699-b64e-4b98-b12e-56e58f3b921b",
            "title": "Das Leben der Anderen",
            "pub_date": 2006,
            "duration": 137,
            "rating": 8.5,
            "description": "Gerd Wiesler is an officer with the Stasi, the East German secret police. The film begins in 1984 when Wiesler attends a play written by Georg Dreyman, who is considered by many to be the ultimate example of the loyal citizen. Wiesler has a gut feeling that Dreyman can't be as ideal as he seems and believes surveillance is called for. The Minister of Culture agrees but only later does Wiesler learn that the Minister sees Dreyman as a rival and lusts after his partner Christa-Maria. The more time he spends listening in on them, the more he comes to care about them. The once rigid Stasi officer begins to intervene in their lives, in a positive way, protecting them whenever possible. Eventually, Wiesler activities catch up to him and while there is no proof of wrongdoing, he finds himself in menial jobs - until the unbelievable happens.                Written by\ngarykmcd",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDUzNjYwNDYyNl5BMl5BanBnXkFtZTcwNjU3ODQ0MQ@@._V1_SX225_CR0,0,225,337_AL_.jpg",
            "categories": [
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "219ad50b-a2af-415e-b2a0-47d7196f17ce",
            "title": "Hotaru no haka",
            "pub_date": 1988,
            "duration": 89,
            "rating": 8.5,
            "description": "The story of Seita and Satsuko, two young Japanese siblings, living in the declining days of World War II. When an American firebombing separates the two children from their parents, the two siblings must rely completely on one another while they struggle to fight for their survival.                Written by\nKyle Perez",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjEwNDVhZjMtYzA1MS00ZWUxLThjOGUtZTliNGZiNGYyMjA3XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,353,500_AL_.jpg",
            "categories": [
                "Animation",
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "6f0d16db-8d53-4dc0-ba92-aa3396e39a64",
            "title": "Paths of Glory",
            "pub_date": 1957,
            "duration": 88,
            "rating": 8.5,
            "description": "The futility and irony of the war in the trenches in WWI is shown as a unit commander in the French army must deal with the mutiny of his men and a glory-seeking general after part of his force falls back under fire in an impossible attack.                Written by\nKeith Loh <loh@sfu.ca>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTI5Nzc0OTMtYzBkMS00NjkxLThmM2UtNjM2ODgxN2M5NjNkXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY500_CR0,0,326,500_AL_.jpg",
            "categories": [
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "34d7ef30-283e-4294-970e-052e8a9f06bf",
            "title": "Django Unchained",
            "pub_date": 2012,
            "duration": 165,
            "rating": 8.4,
            "description": "A German dentist buys the freedom of a slave and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of the slave's wife who belongs to a ruthless plantation owner.                Written by\nBenLobel",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTQ5NjQ1OV5BMl5BanBnXkFtZTcwODg1MDU4OA@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Drama",
                "Western"
            ]
        },
        {
            "uuid": "0139ef39-fa49-4265-8ed9-3f852274cd59",
            "title": "The Shining",
            "pub_date": 1980,
            "duration": 146,
            "rating": 8.4,
            "description": "Signing a contract, Jack Torrance, a normal writer and former teacher agrees to take care of a hotel which has a long, violent past that puts everyone in the hotel in a nervous situation. While Jack slowly gets more violent and angry of his life, his son, Danny, tries to use a special talent, the \"Shining\", to inform the people outside about whatever that is going on in the hotel.                Written by\nJ. S. Golden",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZWFlYmY2MGEtZjVkYS00YzU4LTg0YjQtYzY1ZGE3NTA5NGQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY476_CR0,0,313,476_AL_.jpg",
            "categories": [
                "Drama",
                "Horror"
            ]
        },
        {
            "uuid": "22641cb4-f496-4681-ae5d-90e7abb8da1e",
            "title": "La La Land",
            "pub_date": 2016,
            "duration": 128,
            "rating": 8.5,
            "description": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.                Written by\nEirini",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMzUzNDM2NzM2MV5BMl5BanBnXkFtZTgwNTM3NTg4OTE@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Musical"
            ]
        },
        {
            "uuid": "11688ab9-370e-41d0-95fd-445ddebae547",
            "title": "WALL·E",
            "pub_date": 2008,
            "duration": 98,
            "rating": 8.4,
            "description": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, ...",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTg5OTU0NF5BMl5BanBnXkFtZTcwMjMxMzMzMw@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Family"
            ]
        },
        {
            "uuid": "cd679bef-9660-43ef-8f24-45fa46e6661d",
            "title": "American Beauty",
            "pub_date": 1999,
            "duration": 122,
            "rating": 8.4,
            "description": "Lester and Carolyn Burnham are, on the outside, a perfect husband and wife in a perfect house in a perfect neighborhood. But inside, Lester is slipping deeper and deeper into a hopeless depression. He finally snaps when he becomes infatuated with one of his daughter's friends. Meanwhile, his daughter Jane is developing a happy friendship with a shy boy-next-door named Ricky, who lives with an abusive father.                Written by\nJessie Skinner <eietherbinge@hotmail.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NTI5NzYyNV5BMl5BanBnXkFtZTgwNTkxNTYxMTE@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Drama",
                "Romance"
            ]
        },
        {
            "uuid": "26f75c01-7fa6-4795-ac06-859eda9ffd54",
            "title": "The Dark Knight Rises",
            "pub_date": 2012,
            "duration": 164,
            "rating": 8.5,
            "description": "Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city.                Written by\nWellardRockard",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODQzNDY3Ml5BMl5BanBnXkFtZTcwODA0NTM4Nw@@._V1_SY360_SX243_AL_.jpg",
            "categories": [
                "Action",
                "Thriller"
            ]
        },
        {
            "uuid": "a2f4ee6b-3812-4173-9620-e5cb0415c4dc",
            "title": "Mononoke-hime",
            "pub_date": 1997,
            "duration": 134,
            "rating": 8.4,
            "description": "While protecting his village from rampaging boar-god/demon, a confident young warrior, Ashitaka, is stricken by a deadly curse. To save his life, he must journey to the forests of the west. Once there, he's embroiled in a fierce campaign that humans were waging on the forest. The ambitious Lady Eboshi and her loyal clan use their guns against the gods of the forest and a brave young woman, Princess Mononoke, who was raised by a wolf-god. Ashitaka sees the good in both sides and tries to stem the flood of blood. This is met be animosity by both sides as they each see him as supporting the enemy.                Written by\nChristopher Taguchi",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTVlNWM4NTAtNDQxYi00YWU5LWIwM2MtZmVjYWFmODZiODE5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,353,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "b2e520f9-3ebb-4507-881b-0c2c22880aac",
            "title": "My Test Movie",
            "pub_date": 2024,
            "duration": null,
            "rating": 6.3,
            "description": "This is the description of the movie",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action",
                "Biography",
                "Western",
                "Comedy"
            ]
        },
        {
            "uuid": "809e1be6-4c88-4a3e-b90d-c4b475ab90ac",
            "title": "Test",
            "pub_date": null,
            "duration": 150,
            "rating": 9.0,
            "description": "Description",
            "poster_url": null,
            "categories": [
                "Action",
                "History",
                "Adventure"
            ]
        },
        {
            "uuid": "106bf808-064e-48ec-9768-3feaff3f35c0",
            "title": "My test movie vol 123456789 movie movie movie movie movie movie movie movie movie movie movie movie",
            "pub_date": 2015,
            "duration": 12,
            "rating": 3.1,
            "description": "This is a short description for my test movie",
            "poster_url": null,
            "categories": [
                "Drama",
                "Action",
                "Biography"
            ]
        },
        {
            "uuid": "5f8f5894-fb9b-4c94-b5d8-2750a64ec110",
            "title": "test225",
            "pub_date": 1,
            "duration": 2,
            "rating": 1.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama",
                "Adventure"
            ]
        },
        {
            "uuid": "362aa133-b47c-4682-aab0-ebb3c410a9d7",
            "title": "Check this",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "daecd90c-e78a-4c20-bb10-179e7fb38216",
            "title": "Aliens",
            "pub_date": 1986,
            "duration": 137,
            "rating": 8.4,
            "description": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the \"Aliens\" on the moon LV-426. After the \"Company\" orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come.                Written by\nBrian Rawlings",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNGYxMTA0M2EtYjg0Yy00NzI5LTg4NjEtZDA2MTcyOWM0YTVjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY377_CR0,0,247,377_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "6be99889-cf26-4071-a5bf-1c15f541c4f8",
            "title": "Oldeuboi",
            "pub_date": 2003,
            "duration": 120,
            "rating": 8.4,
            "description": "An average man is kidnapped and imprisoned in a shabby cell for 15 years without explanation. He then is released, equipped with money, a cellphone and expensive clothes. As he strives to explain his imprisonment and get his revenge, Oh Dae-Su soon finds out that his kidnapper has a greater plan for him and is set onto a path of pain and suffering in an attempt to uncover the motive of his mysterious tormentor.                Written by\nJacksrevenge",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NTQyMzU5M15BMl5BanBnXkFtZTcwMTM2MjgyMQ@@._V1_SY333_SX225_AL_.jpg",
            "categories": [
                "Drama",
                "Mystery",
                "Thriller"
            ]
        },
        {
            "uuid": "2988e58d-6390-48d6-9044-b402a930fc45",
            "title": "Once Upon a Time in America",
            "pub_date": 1984,
            "duration": 229,
            "rating": 8.4,
            "description": "Epic tale of a group of Jewish gangsters in New York, from childhood, through their glory years during prohibition, and their meeting again 35 years later.                Written by\nAndrew Welsh <andreww@bnr.ca>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMGFkNWI4MTMtNGQ0OC00MWVmLTk3MTktOGYxN2Y2YWVkZWE2XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,319,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "25cbaa2f-0d2e-4a79-bbaf-d713b2c42f99",
            "title": "Citizen Kane",
            "pub_date": 1941,
            "duration": 119,
            "rating": 8.4,
            "description": "A group of reporters are trying to decipher the last word ever spoken by Charles Foster Kane, the millionaire newspaper tycoon: \"Rosebud.\" The film begins with a news reel detailing Kane's life for the masses, and then from there, we are shown flashbacks from Kane's life. As the reporters investigate further, the viewers see a display of a fascinating man's rise to fame, and how he eventually fell off the top of the world.                Written by\nZack H.",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Mjc1MDQwMl5BMl5BanBnXkFtZTcwNzUyOTUyMg@@._V1_SY250_SX169_AL_.jpg",
            "categories": [
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "80dbff15-70a5-4af0-b724-7f0c60b81238",
            "title": "Das Boot",
            "pub_date": 1981,
            "duration": 149,
            "rating": 8.4,
            "description": "It is 1942 and the German submarine fleet is heavily engaged in the so-called \"Battle of the Atlantic\" to harass and destroy British shipping. With better escorts of the Destroyer Class, however, German U-Boats have begun to take heavy losses. \"Das Boot\" is the story of one such U-Boat crew, with the film examining how these submariners maintained their professionalism as soldiers and attempted to accomplish impossible missions, all the while attempting to understand and obey the ideology of the government under which they served.                Written by\nAnthony Hughes <husnock31@hotmail.com>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNGRmOWY0MGUtNTVhMy00NzRlLTljNDAtNTBiNTRlODgxNmY2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY406_SX290_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "cab1a73f-65da-4e87-af6b-a1b1d7e30550",
            "title": "Witness for the Prosecution",
            "pub_date": 1957,
            "duration": 116,
            "rating": 8.4,
            "description": "It's Britain, 1953. Upon his return to work following a heart attack, irrepressible barrister Sir Wilfrid Robarts, known as a barrister for the hopeless, takes on a murder case, much to the exasperation of his medical team, led by his overly regulated private nurse, Miss Plimsoll, who tries her hardest to ensure that he not return to his hard living ways - including excessive cigar smoking and drinking - while he takes his medication and gets his much needed rest. That case is defending American war veteran Leonard Vole, a poor, out of work, struggling inventor who is accused of murdering his fifty-six year old lonely and wealthy widowed acquaintance, Emily French. The initial evidence is circumstantial but points to Leonard as the murderer. Despite being happily married to East German former beer hall performer Christine Vole, he fostered that friendship with Mrs. French in the hopes that she would finance one of his many inventions to the tune of a few hundred pounds. It thus does ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjgyNTUyNF5BMl5BanBnXkFtZTcwNDQzMDg0Nw@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "0182fc11-4fd5-4a54-b3b0-a241c5213f86",
            "title": "North by Northwest",
            "pub_date": 1959,
            "duration": 136,
            "rating": 8.4,
            "description": "Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore.                Written by\ngarykmcd",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwMTQ0MzgwNl5BMl5BanBnXkFtZTgwNjc4ODE4MzE@._V1_SY500_CR0,0,319,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Mystery"
            ]
        },
        {
            "uuid": "1256a350-4090-4c87-8807-c5337c69c903",
            "title": "Vertigo",
            "pub_date": 1958,
            "duration": 128,
            "rating": 8.4,
            "description": "John \"Scottie\" Ferguson is a retired San Francisco police detective who suffers from acrophobia and Madeleine is the lady who leads him to high places. A wealthy shipbuilder who is an acquaintance from college days approaches Scottie and asks him to follow his beautiful wife, Madeleine. He fears she is going insane, maybe even contemplating suicide, he believes she is possessed by a dead ancestor. Scottie is skeptical, but agrees after he sees the beautiful Madeleine.                Written by\nfilmfactsman",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BYTE4ODEwZDUtNDFjOC00NjAxLWEzYTQtYTI1NGVmZmFlNjdiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY500_CR0,0,322,500_AL_.jpg",
            "categories": [
                "Mystery",
                "Romance",
                "Thriller"
            ]
        },
        {
            "uuid": "218d4829-c7e7-4fba-9a7d-f50c80950c62",
            "title": "Star Wars: Episode VI - Return of the Jedi",
            "pub_date": 1983,
            "duration": 131,
            "rating": 8.4,
            "description": "Luke Skywalker battles horrible Jabba the Hut and cruel Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love and team with Chewbacca, Lando Calrissian, the Ewoks and the androids C-3PO and R2-D2 to aid in the disruption of the Dark Side and the defeat of the evil emperor.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODllZjg2YjUtNWEzNy00ZGY2LTgyZmQtYTkxNDYyOWM3OTUyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,318,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "342404a4-b97e-4dbc-b166-159234f09f1c",
            "title": "My Test Movie",
            "pub_date": 2024,
            "duration": null,
            "rating": 6.3,
            "description": "This is the description of the movie",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action",
                "Biography",
                "Western",
                "Comedy"
            ]
        },
        {
            "uuid": "058d1992-6ccb-483f-975b-40a58aa50a36",
            "title": "My test movie vol. 1234",
            "pub_date": 1920,
            "duration": 121,
            "rating": 5.0,
            "description": "This is a test movie. I am adding several categories.",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action",
                "Biography",
                "History",
                "Adventure"
            ]
        },
        {
            "uuid": "00438509-ddfa-4838-a136-be0290095091",
            "title": "Test Movie Fotis",
            "pub_date": 1997,
            "duration": 120,
            "rating": 8.6,
            "description": "",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "8f2d1064-321e-4a33-aaf1-193b38dcbdbe",
            "title": "k",
            "pub_date": 99,
            "duration": 9,
            "rating": 9.0,
            "description": "88",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "159d8eff-afa1-4e34-bb57-0dbc29836432",
            "title": "Check this",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "7b019275-2b72-4c15-80ac-4ffbde80816c",
            "title": "Reservoir Dogs",
            "pub_date": 1992,
            "duration": 99,
            "rating": 8.4,
            "description": "Six criminals, who are strangers to each other, are hired by a crime boss, Joe Cabot, to carry out a diamond robbery. Right at the outset, they are given false names with the intention that they won't get too close and will concentrate on the job instead. They are completely sure that the robbery is going to be a success. But, when the police show up right at the time and the site of the robbery, panic spreads amongst the group members, and two of them are killed in the subsequent shootout, along with a few policemen and civilians. When the remaining people assemble at the premeditated rendezvous point (a warehouse), they begin to suspect that one of them is an undercover cop.                Written by\nSoumitra",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDc0YWFhMmQtOTFhZC00MzViLTlkNjctMWUzYTI2YWFkNzVlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "15746f9f-a2b8-43a1-b771-c91ad7f0ff14",
            "title": "Braveheart",
            "pub_date": 1995,
            "duration": 178,
            "rating": 8.4,
            "description": "William Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace's father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce.                Written by\nAnonymous",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTMyNGE1ODQtYTNiNS00ZTUyLThhZjktMTgyOGZkZThlYTc3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,338,500_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "5e08bd3f-b79c-4e47-9f63-63eb53737a67",
            "title": "Requiem for a Dream",
            "pub_date": 2000,
            "duration": 102,
            "rating": 8.4,
            "description": "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.                Written by\ngrantss",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTdiNzJlOWUtNWMwNS00NmFlLWI0YTEtZmI3YjIzZWUyY2Y3XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "70cdd9cb-ed4c-44b1-8411-5f285d07046b",
            "title": "Le fabuleux destin d'Amélie Poulain",
            "pub_date": 2001,
            "duration": 122,
            "rating": 8.4,
            "description": "Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then ...                Written by\nspragg_s",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MjVkMWMtYTQ4ZC00ODczLWFjYmQtMDFkZDQ2Y2M0NDVmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,336,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Romance"
            ]
        },
        {
            "uuid": "a0954750-f2f0-4c63-89a1-96a797966886",
            "title": "A Clockwork Orange",
            "pub_date": 1971,
            "duration": 136,
            "rating": 8.3,
            "description": "Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder and rape. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the mean streets of Britain that he had a hand in creating.                Written by\nNikki Carlyle",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjM1Mzc4N15BMl5BanBnXkFtZTgwODM0NzAxMDE@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "3f066e6e-3949-4a0c-b614-13b2cdb72998",
            "title": "Taxi Driver",
            "pub_date": 1976,
            "duration": 113,
            "rating": 8.3,
            "description": "Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew.                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNGQxNDgzZWQtZTNjNi00M2RkLWExZmEtNmE1NjEyZDEwMzA5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,327,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "3336d630-07ad-4780-9b0c-8ba1c01bb04c",
            "title": "Taare Zameen Par",
            "pub_date": 2007,
            "duration": 165,
            "rating": 8.5,
            "description": "Ishaan Awasthi is an eight-year-old whose world is filled with wonders that no one else seems to appreciate; colours, fish, dogs and kites are just not important in the world of adults, who are much more interested in things like homework, marks and neatness. And Ishaan just cannot seem to get anything right in class. When he gets into far more trouble than his parents can handle, he is packed off to a boarding school to 'be disciplined'. Things are no different at his new school, and Ishaan has to contend with the added trauma of separation from his family. One day a new art teacher bursts onto the scene, Ram Shankar Nikumbh, who infects the students with joy and optimism. He breaks all the rules of 'how things are done' by asking them to think, dream and imagine, and all the children respond with enthusiasm, all except Ishaan. Nikumbh soon realizes that Ishaan is very unhappy, and he sets out to discover why. With time, patience and care, he ultimately helps Ishaan find himself.                Written by\nAnonymous",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTVmYTk2NjAtYzY3MS00YjFjLTlkYzktYzg3YzMyZDQyOWRiXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY500_CR0,0,346,500_AL_.jpg",
            "categories": [
                "Drama",
                "Family",
                "Music"
            ]
        },
        {
            "uuid": "37873cc5-75bc-4e6e-a96c-c66899b29c99",
            "title": "My test movie vol. 123",
            "pub_date": null,
            "duration": 121,
            "rating": 9.0,
            "description": "This is my test movie",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action",
                "Biography",
                "History",
                "Adventure"
            ]
        },
        {
            "uuid": "9372f81a-6da1-4ea6-aa81-f9734e7df5e2",
            "title": "Test Movie Fotis",
            "pub_date": 2007,
            "duration": 240,
            "rating": 7.6,
            "description": "This is a test description",
            "poster_url": null,
            "categories": [
                "Thriller",
                "War"
            ]
        },
        {
            "uuid": "a4484a0c-870a-4727-bb3d-59309852f93e",
            "title": "test",
            "pub_date": 1111,
            "duration": 111,
            "rating": 10.0,
            "description": "testing testing",
            "poster_url": null,
            "categories": [
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "ad1241a5-5e88-40d9-b088-ffbdb88c19ce",
            "title": "Mike",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "b953822f-5c2f-469d-b594-ba61af943075",
            "title": "Double Indemnity",
            "pub_date": 1944,
            "duration": 107,
            "rating": 8.4,
            "description": "In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man.                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZmRmYmZkZTktZDc5ZC00ZjZmLTg4NWMtYjM3MjcyNTVjNGQ5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Film-Noir"
            ]
        },
        {
            "uuid": "95058abf-7086-4d36-9095-5e5e6577b470",
            "title": "Eternal Sunshine of the Spotless Mind",
            "pub_date": 2004,
            "duration": 108,
            "rating": 8.3,
            "description": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake.                Written by\nanonymous",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzcwODg3Nl5BMl5BanBnXkFtZTcwNTEwOTMyMw@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Drama",
                "Romance",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "815429d1-a1dc-4099-9e96-ad2ce7732f9e",
            "title": "To Kill a Mockingbird",
            "pub_date": 1962,
            "duration": 129,
            "rating": 8.3,
            "description": "Small-town Alabama, 1932. Atticus Finch (played by Gregory Peck) is a lawyer and a widower. He has two young children, Jem and Scout. Atticus Finch is currently defending Tom Robinson, a black man accused of raping a white woman. Meanwhile, Jem and Scout are intrigued by their neighbours, the Radleys, and the mysterious, seldom-seen Boo Radley in particular.                Written by\ngrantss",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzI1NDY2Nl5BMl5BanBnXkFtZTcwMTcyODc5Mw@@._V1_SY250_SX164_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "585e12d3-50a7-420b-99a3-5d555fe7149a",
            "title": "Amadeus",
            "pub_date": 1984,
            "duration": 160,
            "rating": 8.3,
            "description": "Antonio Salieri believes that Wolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity.                Written by\nKhaled Salem",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NDkwMTk5N15BMl5BanBnXkFtZTYwODg3MDk2._V1_SY352_CR0,0,237,352_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "0e80c200-b36d-48a0-b8ed-f3f71c6fedb2",
            "title": "Toy Story 3",
            "pub_date": 2010,
            "duration": 103,
            "rating": 8.3,
            "description": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.                Written by\nWalt Disney Studios",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTY4Mjc0MF5BMl5BanBnXkFtZTcwNTA4MDQyMw@@._V1_SY500_CR0,0,353,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Comedy"
            ]
        },
        {
            "uuid": "590e58f8-faa3-4955-9b86-6a449bdbddcc",
            "title": "Full Metal Jacket",
            "pub_date": 1987,
            "duration": 116,
            "rating": 8.3,
            "description": "A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive.                Written by\nScott Renshaw <as.idc@forsythe.stanford.edu>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzc2ZThkOGItZGY5YS00MDYwLTkyOTAtNDRmZWIwMGRhYTc0L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,328,500_AL_.jpg",
            "categories": [
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "3a73a938-907b-4ab3-ba37-2ad73eb97cb9",
            "title": "Dangal",
            "pub_date": 2016,
            "duration": 161,
            "rating": 8.9,
            "description": "Biopic of Mahavir Singh Phogat, who taught wrestling to his daughters Babita Kumari and Geeta Phogat. Geeta Phogat was India's first female wrestler to win at the 2010 Commonwealth Games, where she won the gold medal (55 kg) while her sister Babita Kumari won the silver (52 kg).                Written by\nDibyayan_Chakravorty",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzQzMzM2Nl5BMl5BanBnXkFtZTgwMTQ1NzU3MDI@._V1_SY500_CR0,0,356,500_AL_.jpg",
            "categories": [
                "Action",
                "Biography",
                "Drama"
            ]
        },
        {
            "uuid": "8214b511-6da2-4c06-872f-162885a55c8d",
            "title": "The Sting",
            "pub_date": 1973,
            "duration": 129,
            "rating": 8.3,
            "description": "When a mutual friend is killed by a mob boss, two con men, one experienced and one young try to get even by pulling off the big con on the mob boss. The story unfolds with several twists and last minute alterations.                Written by\nJohn Vogel <jlvogel@comcast.net>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjM1OTAyOV5BMl5BanBnXkFtZTgwMDkwODg4MDE@._V1._CR52,57,915,1388_SY500_CR0,0,329,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "d8bfdaaf-08f4-418b-b6a9-d9b67d071a2e",
            "title": "2001: A Space Odyssey",
            "pub_date": 1968,
            "duration": 149,
            "rating": 8.3,
            "description": "\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.                Written by\nLarry Cousins",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTZkZTBhYmUtMTIzNy00YTViLTg1OWItNGUwMmVlN2FjZTVkXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "965cc400-c980-4b13-8e46-2fc5a5336009",
            "title": "Babam ve Oglum",
            "pub_date": 2005,
            "duration": 108,
            "rating": 8.6,
            "description": "Sadik is one of the rebellious youth who has been politically active as a university student and became a left-wing journalist in the 70's, despite his father's expectations of him becoming an agricultural engineer and taking control of their family farm in an Aegean village. On the dawn of September 12, 1980, when a merciless military coup hits the country, they cannot find access to any hospital or a doctor and his wife dies while giving birth to their only child, Deniz. After a long-lasting period of torture, trials, and jail time, Sadik returns to his village with 7-8 years old Deniz, knowing that it will be hard to correct things with his father, Huseyin.                Written by\nAli Riza Bolukbasi",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNjAzMzEwYzctNjc1MC00Nzg5LWFmMGItMTgzYmMyNTY2OTQ4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_SX347_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "1f33eafd-7461-4389-924a-05fd7e52fa0a",
            "title": "Movie Movie  Movie Movie Movie Movie Movie Movie Movie Movie Movie  Movie Movie Movie Movie Movie Movie Movie",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "226473f3-8711-4c9b-9a5a-d87626493ab5",
            "title": "The Teachers Lounge",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "085a0638-2a1d-440f-ad49-e7edf596963a",
            "title": "Test Title Fotis LMAO",
            "pub_date": 11111,
            "duration": 87,
            "rating": 2.5,
            "description": "",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action",
                "Biography",
                "History",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "fab820ef-cef1-459c-a0ad-83f6694b68a0",
            "title": "testttt",
            "pub_date": 1111,
            "duration": 1111,
            "rating": 1.0,
            "description": "test test test",
            "poster_url": null,
            "categories": [
                "Mystery"
            ]
        },
        {
            "uuid": "3c6129ac-ffdd-49d4-8bd6-7f4ddf400623",
            "title": "Mike",
            "pub_date": 0,
            "duration": 0,
            "rating": 10.0,
            "description": "Check this",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "f840bb78-ccb6-422e-a6fd-1aa177afaf15",
            "title": "Singin' in the Rain",
            "pub_date": 1952,
            "duration": 103,
            "rating": 8.3,
            "description": "1927 Hollywood. Monumental Pictures' biggest stars, glamorous on-screen couple Lina Lamont and Don Lockwood, are also an off-screen couple if the trade papers and gossip columns are to be believed. Both perpetuate the public perception if only to please their adoring fans and bring people into the movie theaters. In reality, Don barely tolerates her, while Lina, despite thinking Don beneath her, simplemindedly believes what she sees on screen in order to bolster her own stardom and sense of self-importance. R.F. Simpson, Monumental's head, dismisses what he thinks is a flash in the pan: talking pictures. It isn't until Jazzsångaren (1927) becomes a bona fide hit which results in all the movie theaters installing sound equipment that R.F. knows Monumental, most specifically in the form of Don and Lina, have to jump on the talking picture bandwagon, despite no one at the studio knowing anything about the technology. Musician Cosmo Brown, Don's best friend, gets hired as ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjNGViMjQtOThlMi00MTA3LThkYzQtNzJkYjBkMGE0YzE1XkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY396_SX271_AL_.jpg",
            "categories": [
                "Comedy",
                "Musical",
                "Romance"
            ]
        },
        {
            "uuid": "c2059fd9-a26c-4811-8518-1483d07be931",
            "title": "Toy Story",
            "pub_date": 1995,
            "duration": 81,
            "rating": 8.3,
            "description": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.                Written by\nJohn Wiggins",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMDU2ZWJlMjktMTRhMy00ZTA5LWEzNDgtYmNmZTEwZTViZWJkXkEyXkFqcGdeQXVyNDQ2OTk4MzI@._V1_SY500_SX335_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Comedy"
            ]
        },
        {
            "uuid": "0ad5b4af-c77d-45d2-8090-1e4fea3980df",
            "title": "Ladri di biciclette",
            "pub_date": 1948,
            "duration": 89,
            "rating": 8.3,
            "description": "Ricci, an unemployed man in the depressed post-WWII economy of Italy, gets at last a good job - for which he needs a bike - hanging up posters. But soon his bicycle is stolen. He and his son walk the streets of Rome, looking for the bicycle. Ricci finally manages to locate the thief but with no proof, he has to abandon his cause. But he and his son know perfectly well that without a bike, Ricci won't be able to keep his job.                Written by\njolusoma",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3NTcwNzEtNDA1MS00ZjE0LThkNDEtMmU4MjVmNTQ1ZDBmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY450_SX312_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "76bf911d-4c62-4cd3-935a-d421852a0333",
            "title": "The Kid",
            "pub_date": 1921,
            "duration": 68,
            "rating": 8.3,
            "description": "The opening title reads: \"A comedy with a smile--and perhaps a tear\". As she leaves the charity hospital and passes a church wedding, Edna deposits her new baby with a pleading note in a limousine and goes off to commit suicide. The limo is stolen by thieves who dump the baby by a garbage can. Charlie the Tramp finds the baby and makes a home for him. Five years later Edna has become an opera star but does charity work for slum youngsters in hope of finding her boy. A doctor called by Edna discovers the note with the truth about the Kid and reports it to the authorities who come to take him away from Charlie. Before he arrives at the Orphan Asylum Charlie steals him back and takes him to a flophouse. The proprietor reads of a reward for the Kid and takes him to Edna. Charlie is later awakened by a kind policeman who reunites him with the Kid at Edna's mansion.                Written by\nEd Stephan <stephan@cc.wwu.edu>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjhhMThhNDItNTY2MC00MmU1LTliNDEtNDdhZjdlNTY5ZDQ1XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Family"
            ]
        },
        {
            "uuid": "e1ae0480-5b6a-4a57-85a3-a1e7c44693f0",
            "title": "Inglourious Basterds",
            "pub_date": 2009,
            "duration": 153,
            "rating": 8.3,
            "description": "In German-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.                Written by\nThe Massie Twins",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTJiNDEzOWYtMTVjOC00ZjlmLWE0NGMtZmE1OWVmZDQ2OWJhXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "War"
            ]
        },
        {
            "uuid": "013465aa-7d5c-4576-833b-70581cf1ccdc",
            "title": "Snatch",
            "pub_date": 2000,
            "duration": 104,
            "rating": 8.3,
            "description": "Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Pitt, a 'pikey' ( slang for an Irish Gypsy)- who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off the Irish Gypsies. They then try to convince Pitt not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog!                Written by\nFilmtwob <webmaster@filmfreak.co.za>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDYxOGYtYjU1Mi00Y2QzLTgxMTQtMWI1MGI0ZGQ5MmU4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY500_SX342_AL_.jpg",
            "categories": [
                "Comedy",
                "Crime"
            ]
        },
        {
            "uuid": "1a1f4071-932f-496f-8035-ec91c260d322",
            "title": "Monty Python and the Holy Grail",
            "pub_date": 1975,
            "duration": 91,
            "rating": 8.3,
            "description": "History is turned on its comic head when, in 10th century England, King Arthur travels the countryside to find knights who will join him at the Round Table in Camelot. Gathering up the men is a tale in itself but after a bit of a party at Camelot, many decide to leave only to be stopped by God who sends them on a quest: to find the Holy Grail. After a series of individual adventures, the knights are reunited but must face a wizard named Tim, killer rabbits and lessons in the use of holy hand grenades. Their quest comes to an end however when the police intervene - just what you would expect in a Monty Python movie.                Written by\ngarykmcd",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNmNmZjViNTQtNDQ5Mi00MDYzLWI5YWMtNDUyZGNmMGZhNDg4XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SY384_SX260_AL_.jpg",
            "categories": [
                "Adventure",
                "Comedy",
                "Fantasy"
            ]
        },
        {
            "uuid": "09dfd4c1-a361-4fe8-a939-8c5a5b010239",
            "title": "3 Idiots",
            "pub_date": 2009,
            "duration": 170,
            "rating": 8.4,
            "description": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.                Written by\nrAjOo (gunwanti@hotmail.com)",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZWRlNDdkNzItMzhlZC00YTdmLWIwNjktYjY5NjQ1ZmQ3N2FkXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,373,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama"
            ]
        },
        {
            "uuid": "e631949f-fa51-4589-a4a6-c497b13e3f28",
            "title": "L.A. Confidential",
            "pub_date": 1997,
            "duration": 138,
            "rating": 8.3,
            "description": "1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime.                Written by\nGreg Bole <bole@life.bio.sunysb.edu>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMDBlYzAwZDktNzM2MS00YzBlLWI4ODQtZTlkNmMxZDc3NGRkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY429_SX290_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "6558a5c7-4170-4f2a-9017-d75bf0ade68f",
            "title": "Per qualche dollaro in più",
            "pub_date": 1965,
            "duration": 132,
            "rating": 8.3,
            "description": "Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting.                Written by\nClaudio Carvalho, Rio de Janeiro, Brazil",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjIzOTEzMF5BMl5BanBnXkFtZTcwMTUzNTk3NA@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Western"
            ]
        },
        {
            "uuid": "50990e53-fe3b-4aa5-92e3-6fb85e8d38a1",
            "title": "Scarface",
            "pub_date": 1983,
            "duration": 170,
            "rating": 8.3,
            "description": "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down.                Written by\ngarykmcd",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzOTM4MzEwNl5BMl5BanBnXkFtZTgwMzU1OTc1MDE@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "4757c15d-1dcb-4e89-b159-4231a243c12f",
            "title": "Jagten",
            "pub_date": 2012,
            "duration": 115,
            "rating": 8.3,
            "description": "Lucas is a Kindergarten teacher who takes great care of his students. Unfortunately for him, young Klara has a run-away imagination and concocts a lie about her teacher. Before Lucas is even able to understand the consequences, he has become the outcast of the town. The hunt is on to prove his innocence before it's taken from him for good.                Written by\nnapierslogs",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDg3ODg4NF5BMl5BanBnXkFtZTcwNzk3NTc3Nw@@._V1_SY500_CR0,0,349,500_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "e1430489-4606-4765-afb3-82f29e6d1870",
            "title": "Rashômon",
            "pub_date": 1950,
            "duration": 88,
            "rating": 8.3,
            "description": "A priest, a woodcutter and another man are taking refuge from a rainstorm in the shell of a former gatehouse called Rashômon. The priest and the woodcutter are recounting the story of a murdered samurai whose body the woodcutter discovered three days earlier in a forest grove. Both were summoned to testify at the murder trial, the priest who ran into the samurai and his wife traveling through the forest just before the murder occurred. Three other people who testified at the trial are supposedly the only direct witnesses: a notorious bandit named Tajômaru, who allegedly murdered the samurai and raped his wife; the white veil cloaked wife of the samurai; and the samurai himself who testifies through the use of a medium. The three tell a similarly structured story - that Tajômaru kidnapped and bound the samurai so that he could rape the wife - but which ultimately contradict each other, the motivations and the actual killing being what differ. The woodcutter reveals at Rashômon that he ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDU5MjQ5NF5BMl5BanBnXkFtZTgwMDM2OTE4MzE@._V1_SY500_CR0,0,351,500_AL_.jpg",
            "categories": [
                "Crime",
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "d6905c48-e502-4961-8a9b-0c9de8fbdcca",
            "title": "The Apartment",
            "pub_date": 1960,
            "duration": 125,
            "rating": 8.3,
            "description": "As of November 1, 1959, mild mannered C.C. Baxter has been working at Consolidated Life, an insurance company, for close to four years, and is one of close to thirty-two thousand employees located in their Manhattan head office. To distinguish himself from all the other lowly cogs in the company in the hopes of moving up the corporate ladder, he often works late, but only because he can't get into his apartment, located off of Central Park West, since he has provided it to a handful of company executives - Mssrs. Dobisch, Kirkeby, Vanderhoff and Eichelberger - on a rotating basis for their extramarital liaisons in return for a good word to the personnel director, Jeff D. Sheldrake. When Baxter is called into Sheldrake's office for the first time, he learns that it isn't just to be promoted as he expects, but also to add married Sheldrake to the list to who he will lend his apartment. What Baxter is unaware of is that Sheldrake's mistress is Fran Kubelik, an elevator girl in the ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BN2YxYmUyZGItZWEzYy00NTA3LThhM2UtZThhNDM5NWYxZGQ1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,323,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Drama",
                "Romance"
            ]
        },
        {
            "uuid": "363183d6-a341-411b-92be-466ae143e592",
            "title": "Good Will Hunting",
            "pub_date": 1997,
            "duration": 126,
            "rating": 8.3,
            "description": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart.                Written by\nDima & Danielle",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BOTI0MzcxMTYtZDVkMy00NjY1LTgyMTYtZmUxN2M3NmQ2NWJhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY500_CR0,0,327,500_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "7a32c0b5-9045-428b-b707-26e081efad1a",
            "title": "Jodaeiye Nader az Simin",
            "pub_date": 2011,
            "duration": 123,
            "rating": 8.4,
            "description": "Nader (Peyman Moaadi) and Simin (Leila Hatami) argue about living abroad. Simin prefers to live abroad to provide better opportunities for their only daughter, Termeh. However, Nader refuses to go because he thinks he must stay in Iran and take care of his father (Ali-Asghar Shahbazi), who suffers from Alzheimers. However, Simin is determined to get a divorce and leave the country with her daughter.                Written by\nAmin Davoodi",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzU4NDUwOF5BMl5BanBnXkFtZTcwMTM5MjA5Ng@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Drama",
                "Mystery"
            ]
        },
        {
            "uuid": "7c0f81cc-70d5-430f-b493-058ea9a0726a",
            "title": "Indiana Jones and the Last Crusade",
            "pub_date": 1989,
            "duration": 127,
            "rating": 8.3,
            "description": "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.                Written by\nJwelch5742",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjNkMzc2N2QtNjVlNS00ZTk5LTg0MTgtODY2MDAwNTMwZjBjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY500_CR0,0,339,500_AL_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Fantasy"
            ]
        },
        {
            "uuid": "ac8592ee-6ae1-43f2-9030-a115ce84ca44",
            "title": "gv test movie 1",
            "pub_date": 32766,
            "duration": 1000,
            "rating": 5.0,
            "description": null,
            "poster_url": null,
            "categories": [
                "Crime"
            ]
        },
        {
            "uuid": "9bd44e05-a437-4b0b-89b7-93e4e5d8e178",
            "title": "Tokyo Story",
            "pub_date": 1953,
            "duration": 136,
            "rating": 8.1,
            "description": "An old couple visit their children and grandchildren in the city, but receive little attention.",
            "poster_url": null,
            "categories": [
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "9c8b661a-9bf7-49e3-829c-abbc01dadc44",
            "title": "dwadawdad",
            "pub_date": 3242,
            "duration": 32131,
            "rating": 7.0,
            "description": "dwadadwa",
            "poster_url": null,
            "categories": [
                "Adventure"
            ]
        },
        {
            "uuid": "30c74ef6-3d7b-437c-8583-df702e82a0a9",
            "title": "test2",
            "pub_date": 1111,
            "duration": 1111,
            "rating": 1.0,
            "description": "test test test test",
            "poster_url": null,
            "categories": [
                "Thriller"
            ]
        },
        {
            "uuid": "b3503dcb-be2a-4848-a87a-1bb260c9fc2c",
            "title": "Mike",
            "pub_date": 0,
            "duration": 0,
            "rating": 10.0,
            "description": "asfasfasfasfa",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "58ef23ee-b9d9-4553-8184-6390624bb43e",
            "title": "Metropolis",
            "pub_date": 1927,
            "duration": 153,
            "rating": 8.3,
            "description": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children who quickly disappear. Trying to follow her, he, oblivious to such, is horrified to find an underground world of workers, apparently who run the machinery which keeps the above ground Utopian world functioning. One of the few people above ground who knows about the world below is Freder's father, Joh Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator or the \"heart\". Freder wants to help the plight of the workers in the want for a better life. But when Joh learns of what Maria is espousing and that Freder is joining their cause, Joh, with the assistance of an old colleague and now nemesis named ...                Written by\nHuggo",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNTkyODg1MF5BMl5BanBnXkFtZTgwMDA3NDkwMDE@._V1_SY250_CR0,0,161,250_AL_.jpg",
            "categories": [
                "Drama",
                "Sci-Fi"
            ]
        },
        {
            "uuid": "3d21e19d-dbaf-4500-af13-f46a29421775",
            "title": "All About Eve",
            "pub_date": 1950,
            "duration": 138,
            "rating": 8.3,
            "description": "Eve (Anne Baxter) is waiting backstage to meet her \"idol\" aging Broadway Star, Margo Channing (Bette Davis). It all seems innocent enough as Eve explains that she has seen Margo in EVERY performance of the current play she is in. Only Playright critic DeWitt (George Sanders) sees through Eve's evil plan, which is to take her parts and fiancé, Bill Simpson (Gary Merrill) When the fiancé shows no interest, she tries for playwright Hugh Marlowe (Lloyd Richards) but DeWitt stops her. After she accepts her award, she decides to skip the after-party and goes to her room, where we find a young woman named Phoebe, who snuck into her room and fell asleep. This is where the \"Circle of Life\" now comes to fruition as Eve is going to get played the way she did Margo.",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTAzODI5NV5BMl5BanBnXkFtZTgwMjM4NzQ0MjE@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "57cc4bc2-283c-496a-96aa-8afb61f7bf0f",
            "title": "Yôjinbô",
            "pub_date": 1961,
            "duration": 110,
            "rating": 8.3,
            "description": "Sanjuro, a wandering samurai enters a rural town in nineteenth century Japan. After learning from the innkeeper that the town is divided between two gangsters, he plays one side off against the other. His efforts are complicated by the arrival of the wily Unosuke, the son of one of the gangsters, who owns a revolver. Unosuke has Sanjuro beaten after he reunites an abducted woman with her husband and son, then massacres his father's opponents. During the slaughter, the samurai escapes with the help of the innkeeper; but while recuperating at a nearby temple, he learns of innkeeper's abduction by Unosuke, and returns to the town to confront him.                Written by\nBernard Keane <BKeane2@email.dot.gov.au>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZThiZjAzZjgtNDU3MC00YThhLThjYWUtZGRkYjc2ZWZlOTVjXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Action",
                "Drama",
                "Thriller"
            ]
        },
        {
            "uuid": "c9dcc9ad-7a38-4b80-9553-f3fa2a917861",
            "title": "Batman Begins",
            "pub_date": 2005,
            "duration": 140,
            "rating": 8.3,
            "description": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long.                Written by\nkonstantinwe",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNTM3OTc0MzM2OV5BMl5BanBnXkFtZTYwNzUwMTI3._V1_SY360_CR0,0,242,360_AL_.jpg",
            "categories": [
                "Action",
                "Adventure"
            ]
        },
        {
            "uuid": "4a5947ce-294a-41fe-968e-9025ef7e20bd",
            "title": "Up",
            "pub_date": 2009,
            "duration": 96,
            "rating": 8.3,
            "description": "Carl Fredricksen as a boy wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with a Boy Scout named Russel with help from 500 balloons. On their journey they discover many new friends including a talking dog and Carl and Russel figure out that someone evil plans. Carl soon realizes that this evildoer is his childhood idol. Will they be able to defeat him and will they find Paradise Falls?",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE2NzI4NF5BMl5BanBnXkFtZTgwNzE1MzEyMTE@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Animation",
                "Adventure",
                "Comedy"
            ]
        },
        {
            "uuid": "a7e3c83a-429c-421c-904b-e86f625f9e6c",
            "title": "Some Like It Hot",
            "pub_date": 1959,
            "duration": 120,
            "rating": 8.3,
            "description": "When two Chicago musicians, Joe and Jerry, witness the the St. Valentine's Day massacre, they want to get out of town and get away from the gangster responsible, Spats Colombo. They're desperate to get a gig out of town but the only job they know of is in an all-girl band heading to Florida. They show up at the train station as Josephine and Daphne, the replacement saxophone and bass players. They certainly enjoy being around the girls, especially Sugar Kane Kowalczyk who sings and plays the ukulele. Joe in particular sets out to woo her while Jerry/Daphne is wooed by a millionaire, Osgood Fielding III. Mayhem ensues as the two men try to keep their true identities hidden and Spats Colombo and his crew show up for a meeting with several other crime lords.                Written by\ngarykmcd",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BNzAyOGIxYjAtMGY2NC00ZTgyLWIwMWEtYzY0OWQ4NDFjOTc5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,322,500_AL_.jpg",
            "categories": [
                "Comedy",
                "Romance"
            ]
        },
        {
            "uuid": "03d8703f-776a-461e-958e-a213665c0d0c",
            "title": "The Treasure of the Sierra Madre",
            "pub_date": 1948,
            "duration": 126,
            "rating": 8.3,
            "description": "Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.                Written by\nJim Beaver <jumblejim@prodigy.net>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MzUzOTYwOV5BMl5BanBnXkFtZTgwNDA4MzgyMjE@._V1_SY250_SX169_AL_.jpg",
            "categories": [
                "Adventure",
                "Drama",
                "Western"
            ]
        },
        {
            "uuid": "506d7dc3-f872-477e-8e1c-150c07be69d9",
            "title": "Unforgiven",
            "pub_date": 1992,
            "duration": 131,
            "rating": 8.3,
            "description": "The town of Big Whisky is full of normal people trying to lead quiet lives. Cowboys try to make a living. Sheriff 'Little Bill' tries to build a house and keep a heavy-handed order. The town whores just try to get by.Then a couple of cowboys cut up a whore. Dissatisfied with Bill's justice, the prostitutes put a bounty on the cowboys. The bounty attracts a young gun billing himself as 'The Schofield Kid', and aging killer William Munny. Munny reformed for his young wife, and has been raising crops and two children in peace. But his wife is gone. Farm life is hard. And Munny is no good at it. So he calls his old partner Ned, saddles his ornery nag, and rides off to kill one more time, blurring the lines between heroism and villainy, man and myth.                Written by\nCharlie Ness",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BODM3YWY4NmQtN2Y3Ni00OTg0LWFhZGQtZWE3ZWY4MTJlOWU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY500_CR0,0,332,500_AL_.jpg",
            "categories": [
                "Drama",
                "Western"
            ]
        },
        {
            "uuid": "417cdea5-7f91-4450-80ed-7aab9fb7aa6f",
            "title": "teeeest",
            "pub_date": null,
            "duration": 10,
            "rating": 1.0,
            "description": "09/05/2024 17:23",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama"
            ]
        },
        {
            "uuid": "f3cac2d1-f3ca-4cf5-acaa-613860e3b490",
            "title": "test",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "c818f3e1-96b9-40cc-8194-ae32b45a7067",
            "title": "Test Docker",
            "pub_date": 32,
            "duration": 321,
            "rating": 9.0,
            "description": "This is a docker test",
            "poster_url": null,
            "categories": [
                "Western",
                "Mystery"
            ]
        },
        {
            "uuid": "bd0653ee-f00d-4eb8-9eee-1e82ac5b5192",
            "title": "testttt",
            "pub_date": 1111,
            "duration": 1111,
            "rating": 1.0,
            "description": "test test test test",
            "poster_url": null,
            "categories": [
                "History"
            ]
        },
        {
            "uuid": "b9fb380d-6bc7-4558-aaed-31988d84b820",
            "title": "Mike",
            "pub_date": 0,
            "duration": 0,
            "rating": 10.0,
            "description": "asfasfasfasfa",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "5553a390-0296-49c3-8614-6af0c06de969",
            "title": "Der Untergang",
            "pub_date": 2004,
            "duration": 156,
            "rating": 8.3,
            "description": "In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.                Written by\nAnthony Hughes {husnock31@hotmail.com}",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTI1MjE2Nl5BMl5BanBnXkFtZTcwMTEwMzc4NA@@._V1_SY500_CR0,0,337,500_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "History"
            ]
        },
        {
            "uuid": "c67013ec-d4e8-45e8-93df-ef1e2d78bdf7",
            "title": "Raging Bull",
            "pub_date": 1980,
            "duration": 129,
            "rating": 8.2,
            "description": "When Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone.                Written by\nalfiehitchie",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxOTg3OTc5MF5BMl5BanBnXkFtZTcwNzkwNjMwNA@@._V1_SY500_CR0,0,333,500_AL_.jpg",
            "categories": [
                "Biography",
                "Drama",
                "Sport"
            ]
        },
        {
            "uuid": "cc4a02f3-5740-44e3-8d47-832eb554c5cc",
            "title": "The Third Man",
            "pub_date": 1949,
            "duration": 104,
            "rating": 8.3,
            "description": "An out of work pulp fiction novelist, Holly Martins, arrives in a post war Vienna divided into sectors by the victorious allies, and where a shortage of supplies has lead to a flourishing black market. He arrives at the invitation of an ex-school friend, Harry Lime, who has offered him a job, only to discover that Lime has recently died in a peculiar traffic accident. From talking to Lime's friends and associates Martins soon notices that some of the stories are inconsistent, and determines to discover what really happened to Harry Lime.                Written by\nMark Thompson <mrt@oasis.icl.co.uk>",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BZjQxYmRkMjgtMmZkZi00ZDYyLTk5OTktZWZjZTEzNGZlMWEwXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SY500_CR0,0,335,500_AL_.jpg",
            "categories": [
                "Film-Noir",
                "Mystery",
                "Thriller"
            ]
        },
        {
            "uuid": "c0439a93-a441-4326-97be-975053c781e5",
            "title": "Die Hard",
            "pub_date": 1988,
            "duration": 131,
            "rating": 8.2,
            "description": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands.                Written by\nSam",
            "poster_url": "https://images-na.ssl-images-amazon.com/images/M/MV5BMzNmY2IwYzAtNDQ1NC00MmI4LThkOTgtZmVhYmExOTVhMWRkXkEyXkFqcGdeQXVyMTk5NDA3Nw@@._V1_SX290_CR0,0,290,429_AL_.jpg",
            "categories": [
                "Action",
                "Thriller"
            ]
        },
        {
            "uuid": "f3038870-de74-480b-9526-b6421e6dc30c",
            "title": "Aguirre, the Wrath of God",
            "pub_date": 1972,
            "duration": 95,
            "rating": 7.9,
            "description": "In the 16th century, the ruthless and insane Don Lope de Aguirre leads a Spanish expedition in search of El Dorado. ",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "ba957a52-bb92-4d86-b170-682851811284",
            "title": "The Texas Chain Saw Massacre",
            "pub_date": 1974,
            "duration": 83,
            "rating": 7.5,
            "description": "Two siblings and three of their friends en route to visit their grandfather's grave in Texas end up falling victim to a family of cannibalistic psychopaths and must survive the terrors of Leatherface and his family. ",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "e8489bb7-35db-464c-9198-ad2c487c8400",
            "title": "Unbreakable",
            "pub_date": 2000,
            "duration": 106,
            "rating": 7.3,
            "description": "David Dunn (Willis) is taking a train from New York City back home to Philadelphia after a job interview that didn't go well when his car jumps the tracks and collides with an oncoming engine, with David the only survivor among the 131 passengers on board. Astoundingly, David is not only alive, he hardly seems to have been touched. As David wonders what has happened to him and why he was able to walk away, he encounters a mysterious stranger, Elijah Prince (Samuel L. Jackson), who explains to David that there are a certain number of people who are \"unbreakable\" -- they have remarkable endurance and courage, a predisposition toward dangerous behavior, and feel invincible but also have strange premonitions of terrible events. Is David \"unbreakable\"? And if he is, what are the physical and psychological ramifications of this knowledge?",
            "poster_url": null,
            "categories": [
                "Sci-Fi",
                "Mystery",
                "Drama"
            ]
        },
        {
            "uuid": "4505b4d3-5887-45cd-a045-e091d7407014",
            "title": "The Witches",
            "pub_date": 2020,
            "duration": 120,
            "rating": 10.0,
            "description": "Based on Roald Dahl's 1983 classic book 'The Witches', the story tells the scary, funny and imaginative tale of a seven year old boy who has a run in with some real life witches!",
            "poster_url": null,
            "categories": [
                "Adventure",
                "Comedy",
                "Family"
            ]
        },
        {
            "uuid": "29fd261c-c9c6-4512-9f6c-c0a810f166aa",
            "title": "The Revenant",
            "pub_date": null,
            "duration": 156,
            "rating": 8.0,
            "description": null,
            "poster_url": "https://m.media-amazon.com/images/M/MV5BMDE5OWMzM2QtOTU2ZS00NzAyLWI2MDEtOTRlYjIxZGM0OWRjXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_FMjpg_UY720_.jpg",
            "categories": [
                "Action",
                "Adventure",
                "Drama"
            ]
        },
        {
            "uuid": "678bcf9b-afcc-472d-841a-e096b48379b9",
            "title": "The Shawsank Redemption",
            "pub_date": 1994,
            "duration": 142,
            "rating": 9.3,
            "description": null,
            "poster_url": null,
            "categories": [
                "Action",
                "Musical",
                "Sport"
            ]
        },
        {
            "uuid": "228261cc-db85-4275-b103-dfbcfe05c6b1",
            "title": "Test",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "a3a36d55-86bf-4e75-a033-55f6c7bb3c59",
            "title": "Test",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "0fb72db5-1e40-415c-90b6-074782b8de7e",
            "title": "The Lake House",
            "pub_date": 2006,
            "duration": 105,
            "rating": 7.0,
            "description": "Love blooms when Kate, a doctor, exchanges letters with Alex, an architect who is fed up with his life. Unknown to them, they lead lives two years apart.",
            "poster_url": null,
            "categories": [
                "Romance",
                "Drama"
            ]
        },
        {
            "uuid": "5f3dcac6-460c-4f61-9651-b2505062d1c7",
            "title": "The Lake House",
            "pub_date": 2006,
            "duration": 105,
            "rating": 7.0,
            "description": "Love blooms when Kate, a doctor, exchanges letters with Alex, an architect who is fed up with his life. Unknown to them, they lead lives two years apart.",
            "poster_url": null,
            "categories": [
                "Romance",
                "Drama"
            ]
        },
        {
            "uuid": "029ab5ea-4570-443f-b465-98d70dc41e8f",
            "title": "The One",
            "pub_date": 2001,
            "duration": 87,
            "rating": 5.9,
            "description": "A police officer sets out to kill all versions of himself in a parallel universe in a bid to gain immortality.",
            "poster_url": null,
            "categories": [
                "Romance",
                "Action"
            ]
        },
        {
            "uuid": "d7d24a42-3f3f-4556-b540-2399665da0c0",
            "title": "Morbius 6: Remorbability",
            "pub_date": 2022,
            "duration": 69,
            "rating": 10.0,
            "description": "One of the most compelling and conflicted characters in Sony Pictures Universe of Marvel Characters comes to the big screen as Oscar® winner Jared Leto transforms into the enigmatic antihero Michael Morbius. Dangerously ill with a rare blood disorder and determined to save others suffering his same fate, Dr. Morbius attempts a desperate gamble. While at first it seems to be a radical success, a darkness inside him is unleashed. Will good override evil -- or will Morbius succumb to his mysterious new urges?",
            "poster_url": null,
            "categories": [
                "Action",
                "Fantasy",
                "Adventure",
                "Family"
            ]
        },
        {
            "uuid": "872c8de8-cc0a-4032-ac05-ab7c4adb0a87",
            "title": "Admin movie",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "f18565ba-3869-4808-86f0-a07a10cd268d",
            "title": "Test 2",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "571b2cba-72b5-403e-97a6-f756bfebfe9b",
            "title": "test2",
            "pub_date": 1990,
            "duration": 150,
            "rating": 9.0,
            "description": "test description test description test description test description test description test description test description test description test description test description test descriptiest description test description test description test description test description ",
            "poster_url": null,
            "categories": [
                "Action",
                "Biography",
                "Fantasy"
            ]
        },
        {
            "uuid": "038f8bae-f33f-4e9a-b552-4437b10c0b20",
            "title": "test",
            "pub_date": 9999,
            "duration": 9999,
            "rating": 1.0,
            "description": "test test",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "897978da-e417-43e8-b4ba-080b0bedb506",
            "title": "Test",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "this is one hell of a test",
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "ed2d4859-1aa0-4788-b18e-48150309a134",
            "title": "Morbius 12: It's Re-Remorbin' Time!",
            "pub_date": 2022,
            "duration": 386,
            "rating": 10.0,
            "description": "Morbius returns to New York and discovers he now has superhuman strength, speed, reflexes, and echolocation, with his vampire bats treating him as one of their own. To control his bloodlust, he subsists on his artificial blood as it gradually ceases to satisfy his needs. FBI agents Simon Stroud and Al Rodriguez investigate Morbius' victims and deduce his involvement. Milo learns that Morbius is cured but becomes furious when Morbius refuses to cure him as well. While checking on a hospitalized Bancroft, Morbius finds a dead nurse, drained of her blood. Believing he was responsible, he attempts to escape before being cornered and arrested by Stroud. In prison, he is visited by Milo, who offers to use his wealth to free him. Upon realizing Milo took his cure and killed the nurse, Morbius escapes to confront him. An unrepentant Milo confesses to his bloodlust-induced crime and urges Morbius to embrace his powers as he has. Unwilling to hurt his brother, Morbius flees.\n\nMorbius meets Bancroft to explain what Milo has done before acquiring a new lab and developing an antibody against vampirism to stop and kill Milo; he also plans to use it on himself since he will become unable to resist his bloodlust. Stroud and Rodriguez find footage of one of Milo's attacks and, believing Morbius' vampirism to be spreading, release it to the media. Nicholas recognizes Milo and pleads with him to stop. Angered by Nicholas' perceived preference for Morbius, Milo wounds and forces him to call Morbius, who arrives too late to save him while Milo also mortally wounds Bancroft. Morbius returns to Bancroft, but she dies in his arms, forcing him to drink her blood. Morbius confronts Milo and summons an army of bats to restrain him and inject the antibody. Milo dies peacefully and Morbius flies off with the bats, mourning his loved ones and embracing his identity as a vampire. Unbeknownst to him, Bancroft revives elsewhere as a red-eyed vampire, having ingested a drop of Morbius' blood whilst he was feeding on her.\n\nIn two mid-credits scenes, Adrian Toomes finds himself transported to Morbius' universe.[a] Having deduced that his transportation involved Spider-Man, Toomes approaches the fugitive Morbius and suggests that they form a team.[b] ",
            "poster_url": null,
            "categories": [
                "Animation",
                "Western",
                "Family"
            ]
        },
        {
            "uuid": "b07c5a65-d5e6-4cc7-8c2d-9cccf59ba538",
            "title": "Morbius 13: It's Re-Re-Remorbin' Time!",
            "pub_date": 2047,
            "duration": 440,
            "rating": 10.0,
            "description": "Morbius returns to New York and discovers he now has superhuman strength, speed, reflexes, and echolocation, with his vampire bats treating him as one of their own. To control his bloodlust, he subsists on his artificial blood as it gradually ceases to satisfy his needs. FBI agents Simon Stroud and Al Rodriguez investigate Morbius' victims and deduce his involvement. Milo learns that Morbius is cured but becomes furious when Morbius refuses to cure him as well. While checking on a hospitalized Bancroft, Morbius finds a dead nurse, drained of her blood. Believing he was responsible, he attempts to escape before being cornered and arrested by Stroud. In prison, he is visited by Milo, who offers to use his wealth to free him. Upon realizing Milo took his cure and killed the nurse, Morbius escapes to confront him. An unrepentant Milo confesses to his bloodlust-induced crime and urges Morbius to embrace his powers as he has. Unwilling to hurt his brother, Morbius flees.\n\nMorbius meets Bancroft to explain what Milo has done before acquiring a new lab and developing an antibody against vampirism to stop and kill Milo; he also plans to use it on himself since he will become unable to resist his bloodlust. Stroud and Rodriguez find footage of one of Milo's attacks and, believing Morbius' vampirism to be spreading, release it to the media. Nicholas recognizes Milo and pleads with him to stop. Angered by Nicholas' perceived preference for Morbius, Milo wounds and forces him to call Morbius, who arrives too late to save him while Milo also mortally wounds Bancroft. Morbius returns to Bancroft, but she dies in his arms, forcing him to drink her blood. Morbius confronts Milo and summons an army of bats to restrain him and inject the antibody. Milo dies peacefully and Morbius flies off with the bats, mourning his loved ones and embracing his identity as a vampire. Unbeknownst to him, Bancroft revives elsewhere as a red-eyed vampire, having ingested a drop of Morbius' blood whilst he was feeding on her.\n\nIn two mid-credits scenes, Adrian Toomes finds himself transported to Morbius' universe.[a] Having deduced that his transportation involved Spider-Man, Toomes approaches the fugitive Morbius and suggests that they form a team.[b] ",
            "poster_url": null,
            "categories": [
                "Family",
                "History"
            ]
        },
        {
            "uuid": "6adaf92c-cd1a-4663-81fb-d71241ea092d",
            "title": "Morbius 3: Morbin' Hard",
            "pub_date": 2022,
            "duration": 333,
            "rating": 9.9,
            "description": "25 years later, Morbius publicly declines a Nobel Prize for his work with artificial blood. His colleague Martine Bancroft discovers he has secretly captured dozens of vampire bats from Costa Rica in the hope of splicing their genes with his own to cure his condition. After informing Milo of his planned illegal experiment, Morbius receives funding from him to outfit a private mercenary vessel in international waters with his equipment. While the cure works, it transforms Morbius into a vampire, who kills and drains the crew of their blood after they attack him out of fear. Once his bloodlust subsides and he regains his senses, a horrified Morbius erases all CCTV footage of his experiment before contacting the authorities and jumping overboard.\n\nMorbius returns to New York and discovers he now has superhuman strength, speed, reflexes, and echolocation, with his vampire bats treating him as one of their own. To control his bloodlust, he subsists on his artificial blood as it gradually ceases to satisfy his needs. FBI agents Simon Stroud and Al Rodriguez investigate Morbius' victims and deduce his involvement. Milo learns that Morbius is cured but becomes furious when Morbius refuses to cure him as well. While checking on a hospitalized Bancroft, Morbius finds a dead nurse, drained of her blood. Believing he was responsible, he attempts to escape before being cornered and arrested by Stroud. In prison, he is visited by Milo, who offers to use his wealth to free him. Upon realizing Milo took his cure and killed the nurse, Morbius escapes to confront him. An unrepentant Milo confesses to his bloodlust-induced crime and urges Morbius to embrace his powers as he has. Unwilling to hurt his brother, Morbius flees. ",
            "poster_url": null,
            "categories": [
                "Music"
            ]
        },
        {
            "uuid": "eef38fde-9f9d-4657-8b8a-c7793e33d9b6",
            "title": "Morbius 10: Keep Morbin'",
            "pub_date": 2022,
            "duration": 223,
            "rating": 10.0,
            "description": "Morbius grossed $73.9 million in the United States and Canada, and $93.6 million in other territories, for a worldwide total of $167.5 million.[5][4]\n\nIn the U.S. and Canada, Morbius was projected to gross around $33 million from 4,268 theaters in its opening weekend, with some industry tracking going as high as $40–50 million.[91] The film earned $17.3 million on its first day, including $5.7 million from Thursday preview screenings.[3][92] It went on to debut to $39 million, finishing first at the box office.[3][93] In its second weekend of release in the US and Canada, the film grossed $10.2 million and finished second behind Sonic the Hedgehog 2,[94] while experiencing a drop of 74%, the second-worst of all time for a superhero movie, behind only Steel (1997), and the worst of any tentpole superhero movie.[95] It fell to sixth place at the box office in its third weekend, grossing $4.7 million (a drop of 54%),[96] and dropped to ninth place in its fourth weekend with $2.3 million (a drop of 51%).[97] The film earned $1.5 million in its fifth weekend, finishing tenth.[98] Morbius dropped out of the box office top ten in its sixth weekend.[99] The film's \"re-release\" in theaters during its tenth weekend made $310,665 from 1,037 screens during its first three days.[100]\n\nOutside the US and Canada, the film earned $44.9 million from 62 international markets in its opening weekend, including $2.5 million from IMAX screens.[101] It added $15 million in its second weekend for a drop of 62%.[102] It added $6.7 million in the third weekend,[103] $3.3 million in its fourth,[104] and $1.6 million in its fifth.[105]\n\nOn June 3, 2022, Sony announced the film would return to 1,000 theaters weeks after its initial theatrical and digital release. This was largely attributed to the film's influx in attention from internet memes in the weeks prior.[106] This decision was also met with criticism from various outlets, which speculated that the release was because Sony was unaware that the internet trend was not due to legitimate popular admiration towards the film.[107][108] Upon its re-release the film performed very poorly, making only $85,000 on the day it was released, with many outlets claiming the film bombed for a second time.[109][110] After a dismal $300,000 weekend performance in its re-release—a $289 per-theater average—Sony pulled the film entirely from theaters.[111][5] ",
            "poster_url": null,
            "categories": [
                "War",
                "Fantasy",
                "Romance"
            ]
        },
        {
            "uuid": "82e075bf-27c8-4495-a0ab-064c814cd907",
            "title": "The Prestige",
            "pub_date": 2006,
            "duration": 999,
            "rating": 9.1,
            "description": "In 1890s London, Robert Angier and Alfred Borden work as shills for a magician under the mentorship of John Cutter, an engineer who designs stage magic. During a water tank trick, Angier's wife, Julia, is unable to unbind her hands, fails to escape and drowns. Angier, devastated, blames Borden for using the incorrect knot, causing her death. When Angier asks Borden which knot he used, Borden claims not to know. The two become bitter enemies and rivals. Angier and Borden launch their own magic careers, with Angier working with Cutter, and Borden with the mysterious Fallon. Angier sabotages one of Borden's performances when he slips a real bullet into Borden's pistol during a bullet-catch trick, resulting in Borden losing two of his fingers.\n\nBorden reciprocates by sabotaging Angier's disappearing bird act, killing the bird on stage and injuring a volunteer from the audience. Borden develops a trick he calls the Transported Man, in which he appears to travel instantly between two wardrobes on opposite ends of the stage. Unable to discern Borden's method, Angier cheats and hires a double, Gerald Root, to perform his own version of the trick. The imitation is a greater success, but Angier is dissatisfied, as he considers his version inferior to Borden's. After Borden finds out about the body double Angier is using, he approaches Root, and suggests that he is being underpaid. Root then sabotages a series of performances, seeking a higher fee, leading Angier and Cutter to retire the trick altogether, considering Root to be too volatile to be relied upon.\n\nObsessed with figuring out Borden's trick, Angier has his assistant, Olivia, spy on Borden to learn how he performs the Transported Man. However, Olivia falls in love with Borden and becomes his assistant instead. With her help, Borden sabotages Angier's act, crippling his leg in the process.\n\nConfronted by Angier, Olivia gives him a copy of Borden's encoded diary. Angier acquires the keyword to decode it, \"TESLA\", by threatening to kill Fallon. The diary takes Angier to America to meet scientist Nikola Tesla, who Angier believes built a teleportation machine for Borden. Tesla warns Angier about the dangers of obsession, but agrees to create the machine for him. Angier finishes reading the diary, where Borden reveals that he has no connection to Tesla, and that he faked his diary in order to send Angier on a wild goose chase. Tesla builds a machine for Angier, but instead of teleporting objects, Tesla's machine duplicates anything placed inside it a short distance away.\n\nTesla is driven from Colorado Springs by agents of his rival, Thomas Edison, but has the machine delivered to Angier. He advises Angier to destroy it, saying it will bring him only misery. Borden's wife, Sarah, is driven to suicide by his contradictory personality, alternately loving and cold. Borden tells Olivia that he never loved Sarah, and that he loves her more. Tired of Borden and Angier's feud, Olivia leaves the relationship. In London, Angier debuts the \"Real Transported Man\" using Tesla's machine, appearing to have teleported across the theater. Borden sneaks backstage and witnesses Angier fall through a trapdoor and drown in a tank. He is discovered by Cutter and turned over to the police.\n\nUnable to prove his innocence, Borden is found guilty of murder and sentenced to death. Tesla's machine is sold off to the wealthy Lord Caldlow, a purported magic enthusiast. Cutter visits Caldlow to advise him to destroy the machine and is shocked to discover that Caldlow is Angier, and is alive and well.\n\nAngier visits Borden in prison, accompanied by Borden's daughter Jess. Borden offers the secret to his \"Transported Man\" in exchange for his daughter's safety, but Angier rebuffs him, saying that his own trick is better. Cutter is disgusted that Angier allowed Borden to be sentenced to death, but agrees to help dispose of Tesla's machine. Borden is hanged for Angier's murder.\n\nAngier goes back to the theatre. A stranger enters and shoots Angier, revealing himself as Alfred Borden. Angier discovers \"Borden\" was an identity shared by a pair of identical twins. The brothers performed the original Transported Man together.\n\nA dying Angier then reveals his version of the trick. He would use Tesla's machine to replicate himself, before executing the original version, by dropping them into a locked water tank under the stage. Borden mocks him for creating such an expensive, complicated solution for such a simple trick.\n\nThe theater catches fire and burns, while Borden reunites with his daughter, who has been rescued by Cutter. ",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "10a99574-3be8-4450-afd9-d3c0c6583f2a",
            "title": "My test movie",
            "pub_date": 3000,
            "duration": 0,
            "rating": 10.0,
            "description": "ho ho",
            "poster_url": null,
            "categories": [
                "Film-Noir",
                "Animation",
                "Thriller"
            ]
        },
        {
            "uuid": "f10e6b84-bd95-4882-9478-9c20b07bb57b",
            "title": "...",
            "pub_date": 2022,
            "duration": 170,
            "rating": 10.0,
            "description": "Desc",
            "poster_url": null,
            "categories": [
                "Comedy",
                "Biography"
            ]
        },
        {
            "uuid": "62b5196e-0bd4-4e5c-8cf2-2c55f3b5a406",
            "title": "...",
            "pub_date": 2022,
            "duration": 988,
            "rating": 10.0,
            "description": "desc",
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "b6ebc55f-392c-4ad6-93d0-423580d14a10",
            "title": "test",
            "pub_date": 8484,
            "duration": 90,
            "rating": 8.0,
            "description": "test",
            "poster_url": null,
            "categories": [
                "Crime",
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "2ea9be2c-e2c7-4796-a1c4-4efc7059e5c6",
            "title": "asdasd",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Action"
            ]
        },
        {
            "uuid": "de4e1a61-f507-4625-ba92-1ca2deeadcbd",
            "title": "asddas",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Action"
            ]
        },
        {
            "uuid": "20ba43d7-0693-428c-95c4-bf13a8b42c84",
            "title": "asdasd",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama",
                "Fantasy",
                "Western",
                "Comedy"
            ]
        },
        {
            "uuid": "20ad689f-8d6d-4fb6-b21f-010818500b74",
            "title": "asdsa",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Action",
                "Comedy"
            ]
        },
        {
            "uuid": "19fb9e8c-0734-45fa-b26e-529e1b254419",
            "title": "ghfghd",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Western",
                "Comedy"
            ]
        },
        {
            "uuid": "b6c35b5c-c0dd-436e-8468-85d0911ac126",
            "title": "test title",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Musical"
            ]
        },
        {
            "uuid": "f286066f-ab6d-4798-bb11-afe610222164",
            "title": "test",
            "pub_date": 2030,
            "duration": 120,
            "rating": 5.1,
            "description": "test test",
            "poster_url": null,
            "categories": [
                "Comedy"
            ]
        },
        {
            "uuid": "a4263d6a-a515-4f4c-ab74-6827efdfb682",
            "title": "asd",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": [
                "Western"
            ]
        },
        {
            "uuid": "29077795-ce16-424a-88e0-21b66e690af4",
            "title": "testvg",
            "pub_date": null,
            "duration": 100,
            "rating": 7.0,
            "description": "eateataetaet",
            "poster_url": null,
            "categories": [
                "Drama",
                "Action",
                "Biography"
            ]
        },
        {
            "uuid": "284fbd5d-cd2a-4a6f-9aec-ca1c6af60fa6",
            "title": "Test 2 ",
            "pub_date": 2023,
            "duration": 500,
            "rating": 10.0,
            "description": "tEST DESV",
            "poster_url": null,
            "categories": [
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "c5bf5415-663d-46de-9534-f24d60c0d808",
            "title": "Test movie",
            "pub_date": 2023,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Crime",
                "Action",
                "Adventure"
            ]
        },
        {
            "uuid": "533ad312-39d4-4a8c-90ad-9ad037c2a709",
            "title": "My Test Movie 99999",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama"
            ]
        },
        {
            "uuid": "79bca4a6-99ae-487c-9620-ea9e291a689f",
            "title": "This is a movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie",
            "pub_date": 2024,
            "duration": 123,
            "rating": 1.2,
            "description": "This is a movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie movie",
            "poster_url": null,
            "categories": [
                "History",
                "Biography",
                "Action",
                "Mystery",
                "Thriller",
                "Musical"
            ]
        },
        {
            "uuid": "80d96c0e-77cf-4183-9e18-b5271a413de8",
            "title": "11th movie",
            "pub_date": 2023,
            "duration": 123,
            "rating": 6.2,
            "description": "This is the movie's description",
            "poster_url": null,
            "categories": [
                "Mystery",
                "Thriller",
                "Film-Noir"
            ]
        },
        {
            "uuid": "09194b0b-480c-48b7-ae20-b1363d89771a",
            "title": "12 monkeys",
            "pub_date": 1991,
            "duration": 123,
            "rating": 6.9,
            "description": "Description",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "d480e5b3-29b6-44ce-82a6-b6350207a740",
            "title": "Rabbit R1",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "db01c8b5-a0a3-4904-b114-e4c64caf0a95",
            "title": "My movie",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Horror"
            ]
        },
        {
            "uuid": "e123d0e0-9fea-4408-afa4-5f37f5494cf4",
            "title": "test movie",
            "pub_date": 2024,
            "duration": 120,
            "rating": 4.5,
            "description": "A great movie",
            "poster_url": null,
            "categories": [
                "Action",
                "Adventure"
            ]
        },
        {
            "uuid": "a7799746-947b-465a-8885-e0657326ac89",
            "title": "gg",
            "pub_date": 2020,
            "duration": 120,
            "rating": 8.0,
            "description": "gg gg",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "58d44f99-18d3-45bc-8398-ebd6ed9b9445",
            "title": "dqdqdq",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "6faad9b2-f164-4a80-8bf9-60a8ef99b32c",
            "title": "testr 3029",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "e8cc6dce-824d-459a-805f-ac82def18f1c",
            "title": "qeqweqwe1",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "4ef148db-7e5c-46dc-b494-82161f2c7417",
            "title": "geg otp klsm ",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "8702b318-904b-4c86-b577-876c5423f01f",
            "title": "dfqefewfwe",
            "pub_date": 2023,
            "duration": 231,
            "rating": 5.0,
            "description": "fewfwfw",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "48c8fb2a-f5de-4287-8511-19225efa8b64",
            "title": "wrgwergwe",
            "pub_date": 2023,
            "duration": 120,
            "rating": 3.5,
            "description": "fwfwe wefw",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "fad0a946-d457-4c50-a5a3-e59e5774b34c",
            "title": "fwefwefwef ",
            "pub_date": 2014,
            "duration": 193,
            "rating": 6.5,
            "description": "fwe fwevcvbnyn tynt",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "1ef39bb4-4339-4b99-8127-2943e6495e55",
            "title": "gmskpbne pwm ",
            "pub_date": 2023,
            "duration": 203,
            "rating": 6.8,
            "description": "fwefgwe fweklfnekw fwfn wofwf",
            "poster_url": null,
            "categories": [
                "Crime",
                "Action",
                "Biography"
            ]
        },
        {
            "uuid": "9b37c6f2-a0a4-4cfc-9a9a-e7b25e275299",
            "title": "Title",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Biography",
                "History"
            ]
        },
        {
            "uuid": "32b3ae2a-c79a-4b54-ac9e-8a1b9c22462f",
            "title": "ccc",
            "pub_date": 1990,
            "duration": null,
            "rating": null,
            "description": null,
            "poster_url": null,
            "categories": [
                "Biography",
                "History"
            ]
        },
        {
            "uuid": "6b1665ca-e9e4-4434-bce2-ba4cd974613a",
            "title": "Test vol 133333",
            "pub_date": null,
            "duration": null,
            "rating": null,
            "description": "",
            "poster_url": null,
            "categories": [
                "Drama",
                "Action"
            ]
        },
        {
            "uuid": "2784dfa5-6c7d-4d28-a9db-03b687e5fe9a",
            "title": "The Tragic Case of Blockbuster",
            "pub_date": 2020,
            "duration": 150,
            "rating": 7.0,
            "description": "No one rents",
            "poster_url": null,
            "categories": [
                "Drama",
                "History",
                "Comedy",
                "Horror"
            ]
        },
        {
            "uuid": "7d1867dd-745d-4a8e-a974-2e248362cebf",
            "title": "Test",
            "pub_date": 0,
            "duration": 180,
            "rating": 8.0,
            "description": "test",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "6a9a9a48-7cdb-449d-82db-ee68fe7b99a1",
            "title": "Test",
            "pub_date": 1990,
            "duration": 180,
            "rating": 8.0,
            "description": "test",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "b2189ec0-e5df-4334-a6a6-d2600c846012",
            "title": "Test",
            "pub_date": 1990,
            "duration": 180,
            "rating": 8.0,
            "description": "test",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "e229aa6a-fc76-49d3-acda-a0b550faea25",
            "title": "Test",
            "pub_date": 0,
            "duration": 180,
            "rating": 8.0,
            "description": "test",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "88ed1146-bc1e-451d-b71f-fb9f1b1aa339",
            "title": "test",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "5ffd05cd-bad7-4fda-a653-5c5563d07c11",
            "title": "test",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "e10bac95-46d3-4a97-ac40-ceeebf945b8e",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "bb859674-4364-47ca-aafc-59164cd88faf",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "13fadd76-ed8c-4988-bf4b-dc55da29d83c",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "4d716a57-b219-4c62-a612-fda0593bcfe1",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "63f8f8bc-4aa2-4966-9915-bf156a280a62",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "7fe444b3-9646-4c18-9a8e-a6de6e6a5216",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "8767c9e0-5443-4ba8-a22a-9beeb5e19f0b",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "990337f2-3574-42ac-942d-f7b947887160",
            "title": "test",
            "pub_date": 1990,
            "duration": 100,
            "rating": 100.0,
            "description": "100",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "da7f76f3-738a-4c62-b835-d89c7845468e",
            "title": "Test movie 1998",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "bf52b49d-47a3-4e51-bcb5-133deb44721a",
            "title": "test movie 1998",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": []
        },
        {
            "uuid": "8eca8286-99df-482d-b803-919b7cdea0a4",
            "title": "gfhgf",
            "pub_date": 0,
            "duration": 0,
            "rating": 0.0,
            "description": "",
            "poster_url": null,
            "categories": []
        }
    ]
}